pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
/*=================================================================
  VERA CYBER DEFENSE DASHBOARD  v2.0
  -----------------------------------------------------------------
  Target Hardware : Waveshare ESP32-S3-Touch-LCD-7B
    - MCU         : ESP32-S3-WROOM-1-N16R8 (16MB Flash, 8MB Octal PSRAM)
    - Display     : 7.0" 1024x600 RGB Parallel LCD (RGB565, 30MHz PCLK)
    - Touch       : GT911 Capacitive Touch Controller (I2C SDA=8, SCL=9, INT=4)
    - I/O Expander: CH32V003 MCU via I2C (0x24) - Backlight PWM, Resets
    - Storage     : MicroSD via hardware SDMMC 1-bit mode (CLK=12, CMD=11, D0=13)
    - GUI         : LVGL v8 with Dual Dark/Light Theme Switching

  Exposes five decoy surfaces (ICMP, Telnet, SSH, FTP, HTTP), records
  every probe, credential, and shell payload command, and displays a
  live interactive Cyber SOC Dashboard on the 7" capacitive touch screen.
  Includes a live browser admin dashboard on port 8080.

  DEFENSIVE / RESEARCH USE ONLY.
=================================================================*/

#include <Arduino.h>
#include <WiFi.h>
#include <FS.h>
#include <SD_MMC.h>
#include <time.h>
#include <lvgl.h>
#include <esp_wifi.h>

/* Safe font fallbacks in case custom Montserrat sizes are disabled in lv_conf.h */
#ifndef LV_FONT_MONTSERRAT_10
#define LV_FONT_MONTSERRAT_10 0
#endif
#if !LV_FONT_MONTSERRAT_10
#define lv_font_montserrat_10 lv_font_montserrat_14
#endif

#ifndef LV_FONT_MONTSERRAT_12
#define LV_FONT_MONTSERRAT_12 0
#endif
#if !LV_FONT_MONTSERRAT_12
#define lv_font_montserrat_12 lv_font_montserrat_14
#endif

#ifndef LV_FONT_MONTSERRAT_16
#define LV_FONT_MONTSERRAT_16 0
#endif
#if !LV_FONT_MONTSERRAT_16
#define lv_font_montserrat_16 lv_font_montserrat_14
#endif

#ifndef LV_FONT_MONTSERRAT_28
#define LV_FONT_MONTSERRAT_28 0
#endif
#if !LV_FONT_MONTSERRAT_28
#define lv_font_montserrat_28 lv_font_montserrat_14
#endif

/* Board-specific hardware drivers */
#include "esp_lv_adapter_arduino.h"
#include "rgb_lcd_port.h"
#include "io_extension.h"
#include "touch.h"
#include "gt911.h"

/* lwIP raw layer for ICMP ping interception and ARP MAC address resolution */
#include "lwip/raw.h"
#include "lwip/icmp.h"
#include "lwip/tcpip.h"
#include "lwip/ip_addr.h"
#include "lwip/etharp.h"
#include "lwip/netif.h"

/*=================== 1. USER SETTINGS ==========================*/
static const char *WIFI_SSID = "ESPTEST";
static const char *WIFI_PASS = "uxoricide19950804";

// Hardware storage mount flag (declared early for config loaders)
bool sdOk = false;

// Active mutable Wi-Fi settings (persisted in MicroSD /wifi.cfg to prevent SPI Flash cache disables)
char curWifiSsid[64] = "ESPTEST";
char curWifiPass[64] = "uxoricide19950804";

void saveWifiConfig(const char *s, const char *pass) {
  if (!s || !s[0]) return;
  strncpy(curWifiSsid, s, sizeof(curWifiSsid) - 1);
  curWifiSsid[sizeof(curWifiSsid) - 1] = '\0';
  if (pass) {
    strncpy(curWifiPass, pass, sizeof(curWifiPass) - 1);
    curWifiPass[sizeof(curWifiPass) - 1] = '\0';
  } else {
    curWifiPass[0] = '\0';
  }

  // Persist to MicroSD if mounted (SDMMC does not disable CPU cache)
  if (sdOk) {
    fs::File f = SD_MMC.open("/wifi.cfg", FILE_WRITE);
    if (f) {
      f.println(curWifiSsid);
      f.println(curWifiPass);
      f.close();
      Serial.printf("[WIFI] Credentials saved to SD: %s\n", curWifiSsid);
    }
  }
}

void loadWifiConfig() {
  if (sdOk && SD_MMC.exists("/wifi.cfg")) {
    fs::File f = SD_MMC.open("/wifi.cfg", FILE_READ);
    if (f) {
      String s = f.readStringUntil('\n');
      s.trim();
      String p = f.readStringUntil('\n');
      p.trim();
      f.close();
      if (s.length() > 0) {
        strncpy(curWifiSsid, s.c_str(), sizeof(curWifiSsid) - 1);
        curWifiSsid[sizeof(curWifiSsid) - 1] = '\0';
        strncpy(curWifiPass, p.c_str(), sizeof(curWifiPass) - 1);
        curWifiPass[sizeof(curWifiPass) - 1] = '\0';
        Serial.printf("[WIFI] Loaded credentials from SD: %s\n", curWifiSsid);
        return;
      }
    }
  }
  strncpy(curWifiSsid, WIFI_SSID, sizeof(curWifiSsid) - 1);
  curWifiSsid[sizeof(curWifiSsid) - 1] = '\0';
  strncpy(curWifiPass, WIFI_PASS, sizeof(curWifiPass) - 1);
  curWifiPass[sizeof(curWifiPass) - 1] = '\0';
}

// Decoy identity VERA pretends to be.
static const char *FAKE_HOST = "DVR-CAM-04";

// Secret key for your real admin web dashboard on port 8080.
#define ADMIN_KEY "change-this-key"

// Timezone (Dhaka = UTC+6; change to match your location)
static const long GMT_OFFSET_SEC = 6 * 3600;
static const int  DST_OFFSET_SEC = 0;

// Optional hardware alert LED / Buzzer. -1 = disabled.
#define ALERT_PIN     -1
#define ALERT_MS      60

// Allow attackers into a fake BusyBox shell after 2 failed attempts to harvest payloads.
#define FAKE_SHELL    true

// MicroSD card pins (Waveshare ESP32-S3-Touch-LCD-7B SDMMC 1-bit mode)
#define SDMMC_CLK     12
#define SDMMC_CMD     11
#define SDMMC_D0      13

// Set to true if you have a MicroSD card inserted; false to run in high-speed RAM mode.
#define USE_SD_CARD   false

#define LOG_PATH      "/vera.log"
#define STATE_PATH    "/state.bin"

// Quiet window for repeated pings from the same IP (ms)
#define PING_QUIET_MS 8000

// Rate limit between state saves (ms)
#define STATE_SAVE_MS 20000

// Default screen backlight level (10-100%)
#define DEFAULT_BACKLIGHT 90
/*===============================================================*/


/*=================== 2. TYPES AND GLOBALS ======================*/
bool isDarkMode = true;             // Theme state (Dark vs Light)
uint8_t currentBrightness = DEFAULT_BACKLIGHT;

/* ---- Battery Telemetry & State ---- */
struct BatteryInfo {
  float    voltage;
  int      percent;
  bool     present;
  bool     charging;
  uint16_t rawAdc;
  char     status[32];
  char     pillText[32];
};
BatteryInfo curBat = {0.0f, 0, false, false, 0, "Initializing", "--"};

WiFiServer srvTelnet(23);
WiFiServer srvSSH(22);
WiFiServer srvFTP(21);
WiFiServer srvHTTP(80);
WiFiServer srvAdmin(8080);

/* ---- Threat Counters ---- */
struct Stats {
  uint32_t telnet;
  uint32_t ssh;
  uint32_t ftp;
  uint32_t http;
  uint32_t ping;
  uint32_t total;
  uint32_t creds;
  uint32_t payloads;
  uint32_t scans;
  uint32_t boots;
};
Stats st;

/* ---- Unique IP Tracking & Port-Scan Detector ---- */
#define MAX_IPS 50
struct IpRec {
  uint32_t ip;
  char     mac[18];
  uint8_t  mask;        // 1=telnet, 2=ssh, 4=ftp, 8=http, 16=icmp
  bool     flagged;
  uint32_t lastPing;
};
IpRec   ipTab[MAX_IPS];
uint8_t ipCount = 0;

