pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
/* ---- Captured Credentials & Payloads Store ---- */
#define MAX_CAPTURED 30
struct CapturedCred {
  char time[12];
  char svc[8];
  char ip[16];
  char user[24];
  char pass[24];
};
CapturedCred credTab[MAX_CAPTURED];
uint8_t credCount = 0;

struct CapturedPayload {
  char time[12];
  char svc[8];
  char ip[16];
  char cmd[64];
};
CapturedPayload payloadTab[MAX_CAPTURED];
uint8_t payloadCount = 0;

/* ---- ICMP Queue ---- */
#define ICMP_Q 20
volatile uint32_t icmpQ[ICMP_Q];
volatile uint8_t  icmpHead = 0;
volatile uint8_t  icmpTail = 0;
portMUX_TYPE      icmpMux = portMUX_INITIALIZER_UNLOCKED;

/* ---- Persistence ---- */
#define STATE_MAGIC 0x484E5037UL      /* 'HNP7' */
struct StateBlob {
  uint32_t magic;
  Stats    st;
  uint8_t  ipCount;
  IpRec    ipTab[MAX_IPS];
  bool     darkMode;
  uint8_t  brightness;
  uint32_t sum;
};
bool     stateDirty    = false;
uint32_t lastStateSave = 0;
bool     ntpConfigured = false;

/* ---- Session State ---- */
struct Session {
  WiFiClient c;
  bool       active;
  uint8_t    stage;      // 1=user, 2=pass, 3=shell
  uint8_t    tries;
  uint32_t   last;
  String     line;
  String     user;
  IPAddress  ip;
};
Session tn;
Session ft;

/* ---- Event Log Queue for UI ---- */
#define MAX_UI_EVENTS 50
struct LogEntry {
  char time[12];
  char svc[10];
  char ip[18];
  char mac[18];
  char detail[70];
  uint32_t color;
  bool isAlert;
};
LogEntry logEntries[MAX_UI_EVENTS];
uint8_t  logCount = 0;

/* ---- Forward Declarations ---- */
void timeStr(char *out, size_t n, bool full);
void alertPulse();
String clean(const String &in, size_t cap = 64);
String getMacForIp(IPAddress ip);
void touchIp(IPAddress ip, uint8_t bit, bool &isNewIp, bool &isScan);
bool mountSD();
void saveState(bool force);
bool loadState();
void logEvent(const char *svc, IPAddress ip, const String &detail, uint32_t colourHex, bool isAlert, bool loud = false);
void logCreds(const char *svc, IPAddress ip, const String &u, const String &p);
void checkPayload(const char *svc, IPAddress ip, const String &cmd);
void startIcmpWatch();
void serviceIcmp();
void handleTelnet();
void handleSSH();
void handleFTP();
void handleHTTP();
void handleAdmin();

/* UI Functions */
void showSplash();
void createUI();
void applyTheme(bool dark);
void updateDashboardMetrics();
void addEventToUI(const LogEntry &e);
void updateIpTableUI();
void updateLootUI();
void updateStatusBarUI();
void updateBatteryTelemetry();
uint32_t blobSum(const StateBlob &b);
bool readLine(Session &s);

/* Helper for WiFiServer accept */
static inline WiFiClient srvAccept(WiFiServer &s) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  return s.accept();
#else
  return s.available();
#endif
}

void updateBatteryTelemetry() {
  uint32_t sum = 0;
  const int SAMPLES = 8;
  for (int i = 0; i < SAMPLES; i++) {
    sum += IO_EXTENSION_Adc_Input();
    delayMicroseconds(200);
  }
  curBat.rawAdc = sum / SAMPLES;

  // Waveshare ESP32-S3-Touch-LCD-7B calculation:
  // CH32V003 10-bit ADC (0..1023), 3.3V reference, 3:1 resistor divider:
  float rawV = (float)curBat.rawAdc * (3.0f * 3.3f / 1023.0f);

  if (curBat.voltage <= 0.5f) {
    curBat.voltage = rawV;
  } else {
    curBat.voltage = (curBat.voltage * 0.75f) + (rawV * 0.25f);
  }

  if (curBat.voltage < 2.50f) {
    curBat.present = false;
    curBat.charging = false;
    curBat.percent = 0;
    snprintf(curBat.status, sizeof(curBat.status), "USB Power (No Batt)");
    snprintf(curBat.pillText, sizeof(curBat.pillText), "⚡ USB (5.0V)");
  } else {
    curBat.present = true;
    // Single cell Li-ion discharge range: 3.40V (empty) to 4.20V (full)
    float p = (curBat.voltage - 3.40f) / (4.20f - 3.40f) * 100.0f;
    if (p < 0.0f) p = 0.0f;
    if (p > 100.0f) p = 100.0f;
    curBat.percent = (int)(p + 0.5f);

    if (curBat.voltage >= 4.18f) {
      curBat.charging = false;
      snprintf(curBat.status, sizeof(curBat.status), "Battery Full / Plugged");
      snprintf(curBat.pillText, sizeof(curBat.pillText), "⚡ 100%% (%.2fV)", curBat.voltage);
    } else if (curBat.voltage >= 4.02f) {
      curBat.charging = true;
      snprintf(curBat.status, sizeof(curBat.status), "Charging (CS8501)");
      snprintf(curBat.pillText, sizeof(curBat.pillText), "⚡ CHG %d%% (%.2fV)", curBat.percent, curBat.voltage);
    } else if (curBat.percent <= 15) {
      curBat.charging = false;
      snprintf(curBat.status, sizeof(curBat.status), "Low Battery Warning");
      snprintf(curBat.pillText, sizeof(curBat.pillText), "🪫 %d%% (%.2fV)", curBat.percent, curBat.voltage);
    } else {
      curBat.charging = false;
      snprintf(curBat.status, sizeof(curBat.status), "On Battery (Discharging)");
      snprintf(curBat.pillText, sizeof(curBat.pillText), "🔋 %d%% (%.2fV)", curBat.percent, curBat.voltage);
    }
  }
}


/*=================== 3. SMALL HELPERS ==========================*/
void timeStr(char *out, size_t n, bool full) {
  struct tm t;
  if (getLocalTime(&t, 5)) {
    strftime(out, n, full ? "%Y-%m-%d %H:%M:%S" : "%H:%M:%S", &t);
    return;
  }
  // Fallback to active system uptime if NTP has not yet synchronized
  uint32_t s = millis() / 1000;
  uint32_t hrs = s / 3600;
  uint32_t mins = (s % 3600) / 60;
  uint32_t secs = s % 60;
  if (full) {
    snprintf(out, n, "UP %02u:%02u:%02u", hrs, mins, secs);
  } else {
    snprintf(out, n, "%02u:%02u:%02u", hrs, mins, secs);
  }
}

void alertPulse() {
#if ALERT_PIN >= 0
  digitalWrite(ALERT_PIN, HIGH);
  delay(ALERT_MS);
  digitalWrite(ALERT_PIN, LOW);
#endif
}

String clean(const String &in, size_t cap) {
  String o;
  for (size_t i = 0; i < in.length() && o.length() < cap; i++) {
    char c = in[i];
    if (c >= 32 && c <= 126) o += c;
  }
  o.trim();
  return o;
}

String escapeJson(const String &s) {
  String o;
  o.reserve(s.length() + 8);
  for (size_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '"') o += "\\\"";
    else if (c == '\\') o += "\\\\";
    else if (c == '\r') o += "\\r";
    else if (c == '\n') o += "\\n";
    else if (c == '\t') o += "\\t";
    else if ((uint8_t)c < 32) o += ' ';
    else o += c;
  }
  return o;
}

/* Resolve MAC address for an IP from lwIP ARP table cache */
String getMacForIp(IPAddress ip) {
  if (ip == IPAddress(0, 0, 0, 0)) return String("--");
  if (ip == WiFi.localIP()) return WiFi.macAddress();

  char buf[20] = "--";
  ip4_addr_t ipaddr;
  ipaddr.addr = (uint32_t)ip;
  struct eth_addr *eth_ret = nullptr;
  const ip4_addr_t *ip_ret = nullptr;
  struct netif *netif = nullptr;

  LOCK_TCPIP_CORE();
  NETIF_FOREACH(netif) {
    ssize_t idx = etharp_find_addr(netif, &ipaddr, &eth_ret, &ip_ret);
    if (idx >= 0 && eth_ret != nullptr) {
      snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
               eth_ret->addr[0], eth_ret->addr[1], eth_ret->addr[2],
               eth_ret->addr[3], eth_ret->addr[4], eth_ret->addr[5]);
      break;
    }
  }
  UNLOCK_TCPIP_CORE();

  return String(buf);
}

void touchIp(IPAddress ip, uint8_t bit, bool &isNewIp, bool &isScan) {
  uint32_t v = (uint32_t)ip;
  isNewIp = false;
  isScan  = false;
  for (uint8_t i = 0; i < ipCount; i++) {
    if (ipTab[i].ip == v) {
      ipTab[i].mask |= bit;
      if (ipTab[i].mac[0] == '\0' || strcmp(ipTab[i].mac, "--") == 0) {
        String m = getMacForIp(ip);
        if (m != "--") {
          strncpy(ipTab[i].mac, m.c_str(), sizeof(ipTab[i].mac) - 1);
          ipTab[i].mac[sizeof(ipTab[i].mac) - 1] = '\0';
        }
      }
      uint8_t m = ipTab[i].mask;
      uint8_t n = 0;
      while (m) { n += m & 1; m >>= 1; }
      if (n >= 3 && !ipTab[i].flagged) {
        ipTab[i].flagged = true;
        isScan = true;
        st.scans++;
      }
      return;
    }
  }
  if (ipCount < MAX_IPS) {
    ipTab[ipCount].ip       = v;
    String m = getMacForIp(ip);
    strncpy(ipTab[ipCount].mac, m.c_str(), sizeof(ipTab[ipCount].mac) - 1);
    ipTab[ipCount].mac[sizeof(ipTab[ipCount].mac) - 1] = '\0';
    ipTab[ipCount].mask     = bit;
    ipTab[ipCount].flagged  = false;
    ipTab[ipCount].lastPing = 0;
    ipCount++;
    isNewIp = true;
  }
}


/*=================== 4. SD CARD (SDMMC 1-BIT) ===================*/
bool mountSD() {
#if !USE_SD_CARD
  Serial.println("[SD] MicroSD disabled (USE_SD_CARD=false). Operating in RAM mode.");
  return false;
#else
  if (!SD_MMC.setPins(SDMMC_CLK, SDMMC_CMD, SDMMC_D0)) {
    Serial.println("SD_MMC: setPins failed");
    return false;
  }
  // Mount 1-bit mode, do not format if mount fails
  if (!SD_MMC.begin("/sdcard", true, false)) {
    Serial.println("SD_MMC: mount failed or card missing");
    SD_MMC.end();
    return false;
  }
  uint8_t cardType = SD_MMC.cardType();
  if (cardType == CARD_NONE) {
    Serial.println("SD_MMC: no card detected");
    SD_MMC.end();
    return false;
  }
  uint64_t mb = SD_MMC.cardSize() / (1024ULL * 1024ULL);
  Serial.printf("SD_MMC: mounted successfully, %llu MB\n", mb);
  return true;
#endif
}


