pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
/*=================== 5. PERSISTENT STATE =======================*/
uint32_t blobSum(const StateBlob &b) {
  const uint8_t *p = (const uint8_t *)&b;
  size_t n = sizeof(StateBlob) - sizeof(uint32_t);
  uint32_t s = 0x5678;
  for (size_t i = 0; i < n; i++) s = s * 31 + p[i];
  return s;
}

void saveState(bool force) {
  if (!sdOk) return;
  if (!force && !stateDirty) return;
  if (!force && (millis() - lastStateSave) < STATE_SAVE_MS) return;

  StateBlob b;
  memset(&b, 0, sizeof(b));
  b.magic      = STATE_MAGIC;
  b.st         = st;
  b.ipCount    = ipCount;
  memcpy(b.ipTab, ipTab, sizeof(ipTab));
  b.darkMode   = isDarkMode;
  b.brightness = currentBrightness;
  b.sum        = blobSum(b);

  fs::File f = SD_MMC.open(STATE_PATH, FILE_WRITE);
  if (!f) return;
  f.write((uint8_t *)&b, sizeof(b));
  f.close();

  lastStateSave = millis();
  stateDirty    = false;
}

bool loadState() {
  if (!sdOk) return false;
  fs::File f = SD_MMC.open(STATE_PATH, FILE_READ);
  if (!f) return false;
  if (f.size() != sizeof(StateBlob)) { f.close(); return false; }

  StateBlob b;
  f.read((uint8_t *)&b, sizeof(b));
  f.close();

  if (b.magic != STATE_MAGIC) return false;
  if (b.sum   != blobSum(b))  return false;

  st      = b.st;
  ipCount = (b.ipCount > MAX_IPS) ? MAX_IPS : b.ipCount;
  memcpy(ipTab, b.ipTab, sizeof(ipTab));
  isDarkMode = b.darkMode;
  if (b.brightness >= 10 && b.brightness <= 100) currentBrightness = b.brightness;
  return true;
}


/*=================== 6. LOGGING ================================*/
void fileLog(const char *svc, IPAddress ip, const char *mac, const char *detail) {
  if (!sdOk) return;
  fs::File f = SD_MMC.open(LOG_PATH, FILE_APPEND);
  if (!f) return;
  char ts[24];
  timeStr(ts, sizeof(ts), true);
  f.printf("%s\t%s\t%s\t%s\t%s\n", ts, svc, ip.toString().c_str(), mac ? mac : "--", detail);
  f.close();
}

void logEvent(const char *svc, IPAddress ip, const String &detail,
              uint32_t colourHex, bool isAlert, bool loud) {
  st.total++;
  char ts[12];
  timeStr(ts, sizeof(ts), false);

  String mac = getMacForIp(ip);

  LogEntry entry;
  snprintf(entry.time, sizeof(entry.time), "%s", ts);
  snprintf(entry.svc, sizeof(entry.svc), "%s", svc);
  snprintf(entry.ip, sizeof(entry.ip), "%s", ip.toString().c_str());
  snprintf(entry.mac, sizeof(entry.mac), "%s", mac.c_str());
  snprintf(entry.detail, sizeof(entry.detail), "%s", detail.c_str());
  entry.color = colourHex;
  entry.isAlert = isAlert;

  if (logCount < MAX_UI_EVENTS) {
    logEntries[logCount++] = entry;
  } else {
    for (int i = 0; i < MAX_UI_EVENTS - 1; i++) logEntries[i] = logEntries[i + 1];
    logEntries[MAX_UI_EVENTS - 1] = entry;
  }

  Serial.printf("[%s] %-6s %-15s [%s] %s\n", ts, svc, ip.toString().c_str(), mac.c_str(), detail.c_str());
  fileLog(svc, ip, mac.c_str(), detail.c_str());

  addEventToUI(entry);
  updateDashboardMetrics();
  updateIpTableUI();

  stateDirty = true;
  if (loud) alertPulse();
}

void logCreds(const char *svc, IPAddress ip, const String &u, const String &p) {
  st.creds++;
  char ts[12];
  timeStr(ts, sizeof(ts), false);

  if (credCount < MAX_CAPTURED) {
    snprintf(credTab[credCount].time, sizeof(credTab[credCount].time), "%s", ts);
    snprintf(credTab[credCount].svc,  sizeof(credTab[credCount].svc), "%s", svc);
    snprintf(credTab[credCount].ip,   sizeof(credTab[credCount].ip), "%s", ip.toString().c_str());
    snprintf(credTab[credCount].user, sizeof(credTab[credCount].user), "%s", u.c_str());
    snprintf(credTab[credCount].pass, sizeof(credTab[credCount].pass), "%s", p.c_str());
    credCount++;
  } else {
    for (int i = 0; i < MAX_CAPTURED - 1; i++) credTab[i] = credTab[i + 1];
    snprintf(credTab[MAX_CAPTURED - 1].time, sizeof(credTab[MAX_CAPTURED - 1].time), "%s", ts);
    snprintf(credTab[MAX_CAPTURED - 1].svc,  sizeof(credTab[MAX_CAPTURED - 1].svc), "%s", svc);
    snprintf(credTab[MAX_CAPTURED - 1].ip,   sizeof(credTab[MAX_CAPTURED - 1].ip), "%s", ip.toString().c_str());
    snprintf(credTab[MAX_CAPTURED - 1].user, sizeof(credTab[MAX_CAPTURED - 1].user), "%s", u.c_str());
    snprintf(credTab[MAX_CAPTURED - 1].pass, sizeof(credTab[MAX_CAPTURED - 1].pass), "%s", p.c_str());
  }

  logEvent(svc, ip, "CREDS " + u + " / " + p, 0xF85149, true, true);
  updateLootUI();
  saveState(true);
}

void checkPayload(const char *svc, IPAddress ip, const String &cmd) {
  String l = cmd;
  l.toLowerCase();
  if (l.indexOf("wget") >= 0 || l.indexOf("curl") >= 0 ||
      l.indexOf("tftp") >= 0 || l.indexOf("http://") >= 0 ||
      l.indexOf("busybox") >= 0) {
    st.payloads++;
    char ts[12];
    timeStr(ts, sizeof(ts), false);

    if (payloadCount < MAX_CAPTURED) {
      snprintf(payloadTab[payloadCount].time, sizeof(payloadTab[payloadCount].time), "%s", ts);
      snprintf(payloadTab[payloadCount].svc,  sizeof(payloadTab[payloadCount].svc), "%s", svc);
      snprintf(payloadTab[payloadCount].ip,   sizeof(payloadTab[payloadCount].ip), "%s", ip.toString().c_str());
      snprintf(payloadTab[payloadCount].cmd,  sizeof(payloadTab[payloadCount].cmd), "%s", cmd.c_str());
      payloadCount++;
    } else {
      for (int i = 0; i < MAX_CAPTURED - 1; i++) payloadTab[i] = payloadTab[i + 1];
      snprintf(payloadTab[MAX_CAPTURED - 1].time, sizeof(payloadTab[MAX_CAPTURED - 1].time), "%s", ts);
      snprintf(payloadTab[MAX_CAPTURED - 1].svc,  sizeof(payloadTab[MAX_CAPTURED - 1].svc), "%s", svc);
      snprintf(payloadTab[MAX_CAPTURED - 1].ip,   sizeof(payloadTab[MAX_CAPTURED - 1].ip), "%s", ip.toString().c_str());
      snprintf(payloadTab[MAX_CAPTURED - 1].cmd,  sizeof(payloadTab[MAX_CAPTURED - 1].cmd), "%s", cmd.c_str());
    }

    logEvent(svc, ip, "PAYLOAD " + cmd, 0xF85149, true, true);
    updateLootUI();
    saveState(true);
  }
}


/*=================== 7. ICMP / PING DETECTION ==================*/
#if LWIP_RAW
static struct raw_pcb *icmpPcb = NULL;

static u8_t icmpRecv(void *arg, struct raw_pcb *pcb, struct pbuf *p, const ip_addr_t *addr) {
  (void)arg;
  (void)pcb;
  if (p != NULL && addr != NULL && p->len > 20) {
    const uint8_t *d = (const uint8_t *)p->payload;
    uint8_t ihl = (uint8_t)((d[0] & 0x0F) * 4);
    if (p->len > ihl && d[ihl] == 8) { // 8 = echo request
      uint32_t src = ip4_addr_get_u32(ip_2_ip4(addr));
      portENTER_CRITICAL_ISR(&icmpMux);
      uint8_t nxt = (uint8_t)((icmpHead + 1) % ICMP_Q);
      if (nxt != icmpTail) {
        icmpQ[icmpHead] = src;
        icmpHead = nxt;
      }
      portEXIT_CRITICAL_ISR(&icmpMux);
    }
  }
  return 0; // Return 0 to let lwIP answer normally
}

static void icmpInstall(void *arg) {
  (void)arg;
  icmpPcb = raw_new(IP_PROTO_ICMP);
  if (icmpPcb == NULL) return;
  raw_bind(icmpPcb, IP_ADDR_ANY);
  raw_recv(icmpPcb, icmpRecv, NULL);
}

void startIcmpWatch() {
  tcpip_callback(icmpInstall, NULL);
}
#else
void startIcmpWatch() {
  Serial.println("LWIP_RAW disabled");
}
#endif

void serviceIcmp() {
  while (true) {
    uint32_t src = 0;
    portENTER_CRITICAL(&icmpMux);
    if (icmpTail != icmpHead) {
      src = icmpQ[icmpTail];
      icmpTail = (uint8_t)((icmpTail + 1) % ICMP_Q);
    }
    portEXIT_CRITICAL(&icmpMux);
    if (src == 0) break;

    st.ping++;
    IPAddress ip(src);

    bool nu = false, sc = false;
    touchIp(ip, 16, nu, sc);

