pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
    bool quiet = false;
    for (uint8_t i = 0; i < ipCount; i++) {
      if (ipTab[i].ip == src) {
        if (ipTab[i].lastPing != 0 && (millis() - ipTab[i].lastPing) < PING_QUIET_MS) quiet = true;
        ipTab[i].lastPing = millis();
        break;
      }
    }

    if (!quiet) {
      logEvent("PING", ip, "icmp echo request", 0xDB61A2, false, false);
    } else {
      updateDashboardMetrics();
      stateDirty = true;
    }

    if (sc) logEvent("SCAN", ip, "multi-service probe", 0xBC8CFF, true, true);
  }
}


/*=================== 8. FAKE BUSYBOX SHELL =====================*/
String fakeShell(const String &cmd) {
  String c = cmd;
  c.trim();
  String l = c;
  l.toLowerCase();

  if (l == "") return "";
  if (l.startsWith("ls")) return "bin\ndev\netc\nlib\nmnt\nproc\nsbin\ntmp\nusr\nvar\n";
  if (l.startsWith("pwd")) return "/\n";
  if (l.startsWith("id") || l.startsWith("whoami")) return "uid=0(root) gid=0(root)\n";
  if (l.startsWith("uname")) return "Linux " + String(FAKE_HOST) + " 3.10.14 #1 SMP mips GNU/Linux\n";
  if (l.startsWith("cat /proc/cpuinfo"))
    return "system type\t: MT7620A\ncpu model\t: MIPS 24KEc V5.0\nBogoMIPS\t: 385.02\n";
  if (l.startsWith("cat /proc/mounts"))
    return "rootfs / rootfs rw 0 0\nproc /proc proc rw 0 0\ntmpfs /tmp tmpfs rw 0 0\n";
  if (l.startsWith("free")) return "  total   used   free\nMem:  61120  42188  18932\n";
  if (l.startsWith("ps")) return "  PID USER  COMMAND\n    1 root  init\n  412 root  telnetd\n  530 root  httpd\n";
  if (l.startsWith("busybox")) return "BusyBox v1.20.2 (2016-11-28) multi-call binary.\n";
  if (l.startsWith("wget") || l.startsWith("curl") || l.startsWith("tftp"))
    return "sh: write error: Permission denied\n";
  if (l.startsWith("rm") || l.startsWith("chmod") || l.startsWith("mv")) return "";
  if (l.startsWith("echo ")) return c.substring(5) + "\n";
  if (l.startsWith("enable") || l.startsWith("system") || l.startsWith("shell") || l == "sh") return "";

  int sp = c.indexOf(' ');
  return "sh: " + c.substring(0, sp > 0 ? sp : c.length()) + ": applet not found\n";
}


/*=================== 9. TELNET =================================*/
bool readLine(Session &s) {
  while (s.c.available()) {
    int b = s.c.read();
    if (b < 0) break;
    s.last = millis();
    if (b == 0xFF) { // IAC skip
      if (s.c.available()) s.c.read();
      if (s.c.available()) s.c.read();
      continue;
    }
    if (b == '\n') return true;
    if (b == '\r' || b == 0) continue;
    if (s.line.length() < 96) s.line += (char)b;
  }
  return false;
}

void telnetPrompt() {
  tn.c.print("\r\n");
  tn.c.print(FAKE_HOST);
  tn.c.print(" login: ");
}

void handleTelnet() {
  if (!tn.active) {
    WiFiClient nc = srvAccept(srvTelnet);
    if (!nc) return;
    tn.c      = nc;
    tn.active = true;
    tn.stage  = 1;
    tn.tries  = 0;
    tn.line   = "";
    tn.user   = "";
    tn.last   = millis();
    tn.ip     = nc.remoteIP();
    st.telnet++;
    bool nu = false, sc = false;
    touchIp(tn.ip, 1, nu, sc);
    logEvent("TELNET", tn.ip, "connect", 0x3FB950, false);
    if (sc) logEvent("SCAN", tn.ip, "multi-service probe", 0xBC8CFF, true, true);
    telnetPrompt();
    return;
  }

  if (!tn.c.connected() || (millis() - tn.last) > 120000) {
    tn.c.stop();
    tn.active = false;
    return;
  }

  if (!readLine(tn)) return;
  String in = clean(tn.line);
  tn.line = "";

  if (tn.stage == 1) {
    tn.user = in.length() ? in : "(empty)";
    tn.c.print("\r\nPassword: ");
    tn.stage = 2;
  } else if (tn.stage == 2) {
    logCreds("TELNET", tn.ip, tn.user, in.length() ? in : "(empty)");
    tn.tries++;
    if (FAKE_SHELL && tn.tries >= 2) {
      tn.c.print("\r\n\r\nBusyBox v1.20.2 built-in shell (ash)\r\n\r\n# ");
      tn.stage = 3;
    } else if (tn.tries >= 3) {
      tn.c.print("\r\nLogin incorrect\r\n");
      tn.c.stop();
      tn.active = false;
    } else {
      tn.c.print("\r\nLogin incorrect\r\n");
      telnetPrompt();
      tn.stage = 1;
    }
  } else {
    if (in.length()) {
      logEvent("TELNET", tn.ip, "cmd: " + in, 0x3FB950, false);
      checkPayload("TELNET", tn.ip, in);
    }
    String low = in;
    low.toLowerCase();
    if (low == "exit" || low == "quit" || low == "logout") {
      tn.c.print("\r\n");
      tn.c.stop();
      tn.active = false;
      return;
    }
    tn.c.print("\r\n");
    tn.c.print(fakeShell(in));
    tn.c.print("# ");
  }
}


/*=================== 10. FTP ===================================*/
void handleFTP() {
  if (!ft.active) {
    WiFiClient nc = srvAccept(srvFTP);
    if (!nc) return;
    ft.c      = nc;
    ft.active = true;
    ft.stage  = 1;
    ft.tries  = 0;
    ft.line   = "";
    ft.user   = "";
    ft.last   = millis();
    ft.ip     = nc.remoteIP();
    st.ftp++;
    bool nu = false, sc = false;
    touchIp(ft.ip, 4, nu, sc);
    logEvent("FTP", ft.ip, "connect", 0xD29922, false);
    if (sc) logEvent("SCAN", ft.ip, "multi-service probe", 0xBC8CFF, true, true);
    ft.c.printf("220 %s FTP server (Version 6.4) ready.\r\n", FAKE_HOST);
    return;
  }

  if (!ft.c.connected() || (millis() - ft.last) > 90000) {
    ft.c.stop();
    ft.active = false;
    return;
  }
  if (!readLine(ft)) return;

  String in = clean(ft.line);
  ft.line = "";
  String up = in;
  up.toUpperCase();

  if (up.startsWith("USER")) {
    ft.user = in.length() > 5 ? in.substring(5) : "(empty)";
    ft.c.printf("331 Password required for %s.\r\n", ft.user.c_str());
  } else if (up.startsWith("PASS")) {
    String p = in.length() > 5 ? in.substring(5) : "(empty)";
    logCreds("FTP", ft.ip, ft.user, p);
    ft.tries++;
    ft.c.print("530 Login incorrect.\r\n");
    if (ft.tries >= 3) { ft.c.stop(); ft.active = false; }
  } else if (up.startsWith("QUIT")) {
    ft.c.print("221 Goodbye.\r\n");
    ft.c.stop();
    ft.active = false;
  } else if (up.startsWith("SYST")) {
    ft.c.print("215 UNIX Type: L8\r\n");
  } else if (in.length()) {
    logEvent("FTP", ft.ip, "cmd: " + in, 0xD29922, false);
    ft.c.print("530 Please login with USER and PASS.\r\n");
  }
}


/*=================== 11. SSH ===================================*/
void handleSSH() {
  WiFiClient c = srvAccept(srvSSH);
  if (!c) return;
  IPAddress ip = c.remoteIP();
  st.ssh++;
  bool nu = false, sc = false;
  touchIp(ip, 2, nu, sc);
  logEvent("SSH", ip, "connect", 0x39C5CF, false);
  if (sc) logEvent("SCAN", ip, "multi-service probe", 0xBC8CFF, true, true);

  c.print("SSH-2.0-OpenSSH_7.4p1 Debian-10+deb9u7\r\n");

