pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  String ident;
  uint32_t t0 = millis();
  bool done = false;
  while ((millis() - t0) < 1200 && c.connected() && ident.length() < 80 && !done) {
    while (c.available()) {
      int b = c.read();
      if (b == '\n') { done = true; break; }
      if (b >= 32 && b <= 126) ident += (char)b;
    }
    if (!done) delay(10);
  }
  if (ident.length()) logEvent("SSH", ip, "client: " + clean(ident), 0x39C5CF, false);
  c.stop();
}


/*=================== 12. HTTP DECOY ============================*/
const char LOGIN_PAGE[] PROGMEM = R"HTML(<!DOCTYPE html><html lang=en><head>
<meta charset=utf-8><meta name=viewport content="width=device-width,initial-scale=1">
<title>SynologyNAS — Sign in</title>
<style>
*{box-sizing:border-box;margin:0;padding:0}
html,body{height:100%;width:100%;overflow:hidden}
body{
  display:flex;flex-direction:column;align-items:center;justify-content:center;
  background:linear-gradient(135deg,#0e86ea 0%,#0064c8 45%,#015cb8 75%,#004b96 100%);
  font-family:-apple-system,BlinkMacSystemFont,"Segoe UI",Roboto,"Helvetica Neue",Arial,sans-serif;
  color:#fff;position:relative;user-select:none;
}
body::before{
  content:'';position:absolute;top:-25%;right:-25%;width:110vw;height:150vh;
  border-radius:50%;
  background:radial-gradient(ellipse at center,rgba(255,255,255,0.22) 0%,rgba(255,255,255,0.04) 45%,transparent 70%);
  pointer-events:none;transform:rotate(-15deg);
}
body::after{
  content:'';position:absolute;bottom:-35%;right:-15%;width:120vw;height:140vh;
  border-radius:50%;
  border:1px solid rgba(255,255,255,0.12);
  background:radial-gradient(ellipse at center,rgba(255,255,255,0.12) 0%,transparent 65%);
  pointer-events:none;
}
.login-wrap{position:relative;z-index:2;display:flex;flex-direction:column;align-items:center}
.nas-title{
  font-size:24px;font-weight:400;color:#ffffff;letter-spacing:0.4px;
  margin-bottom:22px;text-shadow:0 1px 4px rgba(0,0,0,0.25);
}
.login-box{
  width:304px;background:rgba(255,255,255,0.22);
  backdrop-filter:blur(20px);-webkit-backdrop-filter:blur(20px);
  border:1px solid rgba(255,255,255,0.32);border-radius:4px;
  box-shadow:0 8px 30px rgba(0,0,0,0.18),0 1px 3px rgba(0,0,0,0.1);
  padding:0 0 16px 0;overflow:hidden;
}
.field-row{
  display:flex;align-items:center;padding:0 14px;height:44px;
  border-bottom:1px solid rgba(255,255,255,0.25);background:rgba(255,255,255,0.06);
}
.field-row:focus-within{background:rgba(255,255,255,0.12)}
.field-icon{width:22px;display:flex;align-items:center;justify-content:center;margin-right:10px;opacity:0.95}
.field-row input{
  flex:1;background:transparent;border:none;outline:none;
  color:#ffffff;font-size:14px;font-family:inherit;
}
.field-row input::placeholder{color:rgba(255,255,255,0.72);font-weight:300}
.chk-row{
  display:flex;align-items:center;padding:12px 16px 14px 16px;font-size:12.5px;color:#ffffff;
  user-select:none;cursor:pointer;
}
.chk-row input[type=checkbox]{
  width:15px;height:15px;margin-right:8px;accent-color:#0076f6;cursor:pointer;
}
.btn-submit{
  display:block;width:calc(100% - 32px);margin:0 16px;height:36px;
  background:linear-gradient(to bottom,#0084f8,#006de0);
  border:1px solid #005bbd;border-radius:3px;color:#ffffff;
  font-size:13.5px;font-weight:500;font-family:inherit;cursor:pointer;
  box-shadow:0 1px 4px rgba(0,0,0,0.2);transition:background 0.15s,box-shadow 0.15s;
}
.btn-submit:hover{background:linear-gradient(to bottom,#1a90f9,#0076ea)}
.btn-submit:active{background:#0062cc}
.err-box{
  margin:10px 16px 0;padding:6px 10px;background:rgba(220,38,38,0.35);
  border:1px solid rgba(248,113,113,0.5);border-radius:3px;color:#fff;
  font-size:11.5px;text-align:center;
}
.footer-brand{
  position:absolute;bottom:22px;right:28px;color:rgba(255,255,255,0.45);
  font-size:12px;font-weight:400;letter-spacing:0.2px;z-index:2;display:flex;align-items:center;
}
.footer-brand b{font-weight:600;color:rgba(255,255,255,0.6);margin-right:4px}
.footer-brand span.beta{
  font-size:9px;font-weight:700;letter-spacing:0.8px;
  border:1px solid rgba(255,255,255,0.35);border-radius:2px;
  padding:0 3px;margin-left:5px;line-height:1.2;
}
</style></head><body>
<div class=login-wrap>
  <div class=nas-title>SynologyNAS</div>
  <form class=login-box method=POST action=/login>
    <div class=field-row>
      <div class=field-icon>
        <svg width=17 height=17 viewBox="0 0 24 24" fill=#ffffff><path d="M12 12c2.21 0 4-1.79 4-4s-1.79-4-4-4-4 1.79-4 4 1.79 4 4 4zm0 2c-2.67 0-8 1.34-8 4v2h16v-2c0-2.66-5.33-4-8-4z"/></svg>
      </div>
      <input name=username type=text placeholder=Username autocomplete=username>
    </div>
    <div class=field-row>
      <div class=field-icon>
        <svg width=17 height=17 viewBox="0 0 24 24" fill=#ffffff><path d="M18 8h-1V6c0-2.76-2.24-5-5-5S7 3.24 7 6v2H6c-1.1 0-2 .9-2 2v10c0 1.1.9 2 2 2h12c1.1 0 2-.9 2-2V10c0-1.1-.9-2-2-2zm-6 9c-1.1 0-2-.9-2-2s.9-2 2-2 2 .9 2 2-.9 2-2 2zm3.1-9H8.9V6c0-1.71 1.39-3.1 3.1-3.1 1.71 0 3.1 1.39 3.1 3.1v2z"/></svg>
      </div>
      <input name=password type=password placeholder=Password autocomplete=current-password>
    </div>
    <div class=chk-row onclick="var c=document.getElementById('chkStay');c.checked=!c.checked;">
      <input id=chkStay type=checkbox checked onclick="event.stopPropagation()">
      <span>Stay signed in</span>
    </div>
    %MSG%
    <button class=btn-submit type=submit>Sign in</button>
  </form>
</div>
<div class=footer-brand>
  <b>Synology</b> DSM 6.1 <span class=beta>BETA</span>
</div>
</body></html>)HTML";

String urlDecode(String s) {
  String o;
  char a, b;
  for (uint16_t i = 0; i < s.length(); i++) {
    if (s[i] == '%' && (uint32_t)(i + 2) < s.length()) {
      a = s[i + 1];
      b = s[i + 2];
      a = (a <= '9') ? a - '0' : (a & 0xDF) - 'A' + 10;
      b = (b <= '9') ? b - '0' : (b & 0xDF) - 'A' + 10;
      o += (char)(a * 16 + b);
      i += 2;
    } else if (s[i] == '+') {
      o += ' ';
    } else {
      o += s[i];
    }
  }
  return o;
}

String formField(const String &body, const String &key) {
  int i = body.indexOf(key + "=");
  if (i < 0) return "";
  i += key.length() + 1;
  int e = body.indexOf('&', i);
  int sp = body.indexOf(' ', i);
  if (e < 0 || (sp >= 0 && sp < e)) e = sp;
  int cr = body.indexOf('\r', i);
  if (e < 0 || (cr >= 0 && cr < e)) e = cr;
  int nl = body.indexOf('\n', i);
  if (e < 0 || (nl >= 0 && nl < e)) e = nl;
  if (e < 0) e = body.length();
  return urlDecode(body.substring(i, e));
}

