pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
void handleHTTP() {
  WiFiClient c = srvAccept(srvHTTP);
  if (!c) return;
  IPAddress ip = c.remoteIP();
  st.http++;
  bool nu = false, sc = false;
  touchIp(ip, 8, nu, sc);

  String headers;
  uint32_t t0 = millis();
  while ((millis() - t0) < 2000 && c.connected()) {
    if (c.available()) {
      char ch = c.read();
      headers += ch;
      if (headers.length() > 2000) break;
      if (headers.endsWith("\r\n\r\n")) break;
    } else {
      delay(2);
    }
  }
  int nl = headers.indexOf("\r\n");
  String req = (nl > 0) ? headers.substring(0, nl) : headers;

  String body;
  int cl = 0;
  int p = headers.indexOf("Content-Length:");
  if (p < 0) p = headers.indexOf("content-length:");
  if (p >= 0) cl = headers.substring(p + 15, headers.indexOf("\r\n", p)).toInt();
  if (cl > 0 && cl < 1024) {
    t0 = millis();
    while ((int)body.length() < cl && (millis() - t0) < 1500 && c.connected()) {
      while (c.available() && (int)body.length() < cl) body += (char)c.read();
      delay(2);
    }
  }

  String ua;
  p = headers.indexOf("User-Agent:");
  if (p < 0) p = headers.indexOf("user-agent:");
  if (p >= 0) ua = clean(headers.substring(p + 11, headers.indexOf("\r\n", p)), 40);

  String path = "/", method = "GET";
  int s1 = req.indexOf(' ');
  int s2 = req.indexOf(' ', s1 + 1);
  if (s1 > 0) {
    method = req.substring(0, s1);
    if (s2 > s1) path = req.substring(s1 + 1, s2);
  }

  logEvent("HTTP", ip, method + " " + clean(path, 30), 0xF0883E, false);
  if (sc) logEvent("SCAN", ip, "multi-service probe", 0xBC8CFF, true, true);
  if (ua.length()) logEvent("HTTP", ip, "UA " + ua, 0x8B949E, false);

  if (path != "/" && path != "/favicon.ico" && path != "/login")
    logEvent("HTTP", ip, "PROBE " + clean(path, 34), 0xF85149, true, true);

  String msg;
  if (method == "POST" && body.length()) {
    String u = clean(formField(body, "username"));
    String w = clean(formField(body, "password"));
    if (u.length() || w.length()) {
      logCreds("HTTP", ip, u.length() ? u : "(empty)", w.length() ? w : "(empty)");
    } else {
      logEvent("HTTP", ip, "POST " + clean(body, 34), 0xF85149, true, true);
    }
    msg = "<div class='err-box'>The username or password is invalid.</div>";
  }

  String page = FPSTR(LOGIN_PAGE);
  page.replace("%MSG%", msg);
  c.print("HTTP/1.1 200 OK\r\nServer: lighttpd/1.4.35\r\n"
          "Content-Type: text/html\r\nConnection: close\r\nContent-Length: ");
  c.print(page.length());
  c.print("\r\n\r\n");
  c.print(page);
  delay(5);
  c.stop();
}


/*=================== 13. WEB DASHBOARD :8080 ==================*/

/* ── Login page (Synology DSM 6.1 Authenticator Gateway) ─────── */
static const char LOGIN_HTML[] PROGMEM = R"HTML(<!DOCTYPE html><html lang=en><head>
<meta charset=utf-8><meta name=viewport content="width=device-width,initial-scale=1">
<title>SynologyNAS — Sign in</title>
<style>
*{box-sizing:border-box;margin:0;padding:0}
html,body{height:100%;width:100%;overflow:hidden}
body{
  display:flex;flex-direction:column;align-items:center;justify-content:center;
  background:linear-gradient(135deg,#0e86ea 0%,#0064c8 45%,#015cb8 75%,#004b96 100%);
  font-family:-apple-system,BlinkMacSystemFont,"Segoe UI",Roboto,"Helvetica Neue",Arial,sans-serif;
  color:#fff;position:relative;user-select:none;
}
body::before{
  content:'';position:absolute;top:-25%;right:-25%;width:110vw;height:150vh;
  border-radius:50%;
  background:radial-gradient(ellipse at center,rgba(255,255,255,0.22) 0%,rgba(255,255,255,0.04) 45%,transparent 70%);
  pointer-events:none;transform:rotate(-15deg);
}
body::after{
  content:'';position:absolute;bottom:-35%;right:-15%;width:120vw;height:140vh;
  border-radius:50%;
  border:1px solid rgba(255,255,255,0.12);
  background:radial-gradient(ellipse at center,rgba(255,255,255,0.12) 0%,transparent 65%);
  pointer-events:none;
}
.login-wrap{position:relative;z-index:2;display:flex;flex-direction:column;align-items:center}
.nas-title{
  font-size:24px;font-weight:400;color:#ffffff;letter-spacing:0.4px;
  margin-bottom:22px;text-shadow:0 1px 4px rgba(0,0,0,0.25);
}
.login-box{
  width:304px;background:rgba(255,255,255,0.22);
  backdrop-filter:blur(20px);-webkit-backdrop-filter:blur(20px);
  border:1px solid rgba(255,255,255,0.32);border-radius:4px;
  box-shadow:0 8px 30px rgba(0,0,0,0.18),0 1px 3px rgba(0,0,0,0.1);
  padding:0 0 16px 0;overflow:hidden;
}
.field-row{
  display:flex;align-items:center;padding:0 14px;height:44px;
  border-bottom:1px solid rgba(255,255,255,0.25);background:rgba(255,255,255,0.06);
}
.field-row:focus-within{background:rgba(255,255,255,0.12)}
.field-icon{width:22px;display:flex;align-items:center;justify-content:center;margin-right:10px;opacity:0.95}
.field-row input{
  flex:1;background:transparent;border:none;outline:none;
  color:#ffffff;font-size:14px;font-family:inherit;
}
.field-row input::placeholder{color:rgba(255,255,255,0.72);font-weight:300}
.chk-row{
  display:flex;align-items:center;padding:12px 16px 14px 16px;font-size:12.5px;color:#ffffff;
  user-select:none;cursor:pointer;
}
.chk-row input[type=checkbox]{
  width:15px;height:15px;margin-right:8px;accent-color:#0076f6;cursor:pointer;
}
.btn-submit{
  display:block;width:calc(100% - 32px);margin:0 16px;height:36px;
  background:linear-gradient(to bottom,#0084f8,#006de0);
  border:1px solid #005bbd;border-radius:3px;color:#ffffff;
  font-size:13.5px;font-weight:500;font-family:inherit;cursor:pointer;
  box-shadow:0 1px 4px rgba(0,0,0,0.2);transition:background 0.15s,box-shadow 0.15s;
}
.btn-submit:hover{background:linear-gradient(to bottom,#1a90f9,#0076ea)}
.btn-submit:active{background:#0062cc}
.err-box{
  margin:10px 16px 0;padding:6px 10px;background:rgba(220,38,38,0.35);
  border:1px solid rgba(248,113,113,0.5);border-radius:3px;color:#fff;
  font-size:11.5px;text-align:center;display:none;
}
.footer-brand{
  position:absolute;bottom:22px;right:28px;color:rgba(255,255,255,0.45);
  font-size:12px;font-weight:400;letter-spacing:0.2px;z-index:2;display:flex;align-items:center;
}
.footer-brand b{font-weight:600;color:rgba(255,255,255,0.6);margin-right:4px}
.footer-brand span.beta{
  font-size:9px;font-weight:700;letter-spacing:0.8px;
  border:1px solid rgba(255,255,255,0.35);border-radius:2px;
  padding:0 3px;margin-left:5px;line-height:1.2;
}
</style></head><body>
<div class=login-wrap>
  <div class=nas-title>SynologyNAS</div>
  <div class=login-box>
    <div class=field-row>
      <div class=field-icon>
        <svg width=17 height=17 viewBox="0 0 24 24" fill=#ffffff><path d="M12 12c2.21 0 4-1.79 4-4s-1.79-4-4-4-4 1.79-4 4 1.79 4 4 4zm0 2c-2.67 0-8 1.34-8 4v2h16v-2c0-2.66-5.33-4-8-4z"/></svg>
      </div>
      <input id=u type=text placeholder=Username autocomplete=username value=admin>
    </div>
    <div class=field-row>
      <div class=field-icon>
        <svg width=17 height=17 viewBox="0 0 24 24" fill=#ffffff><path d="M18 8h-1V6c0-2.76-2.24-5-5-5S7 3.24 7 6v2H6c-1.1 0-2 .9-2 2v10c0 1.1.9 2 2 2h12c1.1 0 2-.9 2-2V10c0-1.1-.9-2-2-2zm-6 9c-1.1 0-2-.9-2-2s.9-2 2-2 2 .9 2 2-.9 2-2 2zm3.1-9H8.9V6c0-1.71 1.39-3.1 3.1-3.1 1.71 0 3.1 1.39 3.1 3.1v2z"/></svg>
      </div>
      <input id=p type=password placeholder=Password autocomplete=current-password>
    </div>
    <div class=chk-row onclick="var c=document.getElementById('chkStay');c.checked=!c.checked;">
      <input id=chkStay type=checkbox checked onclick="event.stopPropagation()">
      <span>Stay signed in</span>
    </div>
    <div class=err-box id=err>The username or password is invalid.</div>
    <button class=btn-submit type=button onclick=tryLogin()>Sign in</button>
  </div>
</div>
<div class=footer-brand>
  <b>Synology</b> DSM 6.1 <span class=beta>BETA</span>
</div>
<script>
document.getElementById('p').addEventListener('keydown',function(e){if(e.key==='Enter')tryLogin();});
document.getElementById('u').addEventListener('keydown',function(e){if(e.key==='Enter')tryLogin();});
function tryLogin(){
  var k=document.getElementById('p').value.trim();
  var u=document.getElementById('u').value.trim();
  if(!k && u) k = u;
  if(!k){document.getElementById('err').style.display='block';return;}
  fetch('/api?key='+encodeURIComponent(k))
    .then(function(r){
      if(r.ok&&r.status===200){
        try{ sessionStorage.setItem('vera_key',k); }catch(e){}
        window.location='/ui?key='+encodeURIComponent(k);
      } else {
        document.getElementById('err').style.display='block';
      }
    })
    .catch(function(){document.getElementById('err').style.display='block';});
}
</script></body></html>)HTML";

