pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
/* ── Full mirrored dashboard ─────────────────────────────────── */
static const char DASH_HTML[] PROGMEM = R"HTML(<!DOCTYPE html><html lang=en><head>
<meta charset=utf-8><meta name=viewport content="width=device-width,initial-scale=1">
<title>VERA — Dashboard</title>
<style>
:root{--bg:#090e14;--card:#0f1720;--card2:#141b23;--line:#1a2535;--txt:#c9d6e2;--dim:#4d6478;
--telnet:#3fb950;--ssh:#39c5cf;--ftp:#d29922;--http:#f0883e;--ping:#db61a2;
--cred:#f85149;--scan:#bc8cff;--sys:#6b7d8f;--blue:#58a6ff}
*{box-sizing:border-box;margin:0;padding:0}
body{background:var(--bg);color:var(--txt);
  font:13px/1.5 'Segoe UI',system-ui,sans-serif;min-height:100vh;display:flex;flex-direction:column}
/* ── Header ── */
header{background:#0b1520;border-bottom:1px solid var(--line);
  padding:0 18px;height:52px;display:flex;align-items:center;gap:10px;position:sticky;top:0;z-index:99}
.logo{font-size:18px;font-weight:800;letter-spacing:3px;color:#58d9f9;
  text-shadow:0 0 14px rgba(88,217,249,.3);margin-right:4px}
.logo-sub{font-size:9.5px;color:var(--dim);letter-spacing:1.5px;text-transform:uppercase;line-height:1}
.pill{background:var(--card);border:1px solid var(--line);padding:3px 10px;
  border-radius:99px;font-size:11px;color:var(--dim);white-space:nowrap}
.pill.ok{color:var(--telnet);border-color:#1c3a24}
.pill.bad{color:var(--cred);border-color:#4a1d1d}
.pill.warn{color:#d29922;border-color:#4a3800}
.pill.chg{color:#3fb950;border-color:#1c3a24}
.pill.low{color:#f85149;border-color:#4a1d1d}
.hdr-right{margin-left:auto;display:flex;align-items:center;gap:6px}
/* ── Tab nav ── */
nav{background:#0b1520;border-bottom:1px solid var(--line);
  display:flex;padding:0 18px;gap:2px}
.tab{padding:10px 16px;font-size:12px;font-weight:500;cursor:pointer;color:var(--dim);
  border-bottom:2px solid transparent;transition:color .15s,border-color .15s;letter-spacing:.3px}
.tab.active{color:var(--blue);border-bottom-color:var(--blue)}
.tab:hover:not(.active){color:var(--txt)}
/* ── Content ── */
main{flex:1;padding:16px 18px;max-width:1400px;width:100%;margin:auto}
/* ── Metric grid ── */
.grid{display:grid;gap:8px;grid-template-columns:repeat(auto-fit,minmax(110px,1fr));margin-bottom:10px}
.card{background:var(--card2);border:1px solid var(--line);border-radius:10px;padding:10px 13px;
  position:relative;overflow:hidden}
.card::before{content:'';position:absolute;inset:0;opacity:.04;border-radius:10px}
.card.telnet{border-left:3px solid var(--telnet)}.card.telnet::before{background:var(--telnet)}
.card.ssh{border-left:3px solid var(--ssh)}.card.ssh::before{background:var(--ssh)}
.card.ftp{border-left:3px solid var(--ftp)}.card.ftp::before{background:var(--ftp)}
.card.http{border-left:3px solid var(--http)}.card.http::before{background:var(--http)}
.card.ping{border-left:3px solid var(--ping)}.card.ping::before{background:var(--ping)}
.card.cred{border-left:3px solid var(--cred)}.card.cred::before{background:var(--cred)}
.card.scan{border-left:3px solid var(--scan)}.card.scan::before{background:var(--scan)}
.card .lbl{font-size:10px;color:var(--dim);text-transform:uppercase;letter-spacing:.6px;margin-bottom:3px}
.card .val{font-size:26px;font-weight:700;line-height:1}
/* ── Two-column layout ── */
.row2{display:grid;grid-template-columns:1fr 1fr;gap:10px;margin-top:10px}
@media(max-width:700px){.row2{grid-template-columns:1fr}}
.panel{background:var(--card2);border:1px solid var(--line);border-radius:10px;padding:13px 15px}
.panel-title{font-size:10.5px;color:var(--dim);text-transform:uppercase;letter-spacing:.8px;
  margin-bottom:10px;font-weight:600}
/* ── Distribution bars ── */
.bar{display:flex;align-items:center;gap:8px;margin:6px 0}
.bar .bl{width:56px;font-size:11px;font-weight:600;color:var(--dim)}
.bar .bt{flex:1;background:#0b1520;border-radius:4px;height:14px;border:1px solid var(--line);overflow:hidden}
.bar .bf{display:block;height:100%;border-radius:3px;transition:width .4s ease;min-width:0}
.bar .bn{width:40px;text-align:right;font-size:11px;font-weight:700}
/* ── Ticker ── */
.ticker{font-size:11px;line-height:2;font-family:ui-monospace,Menlo,monospace}
.ticker div{padding:2px 0;border-bottom:1px solid var(--line);white-space:nowrap;overflow:hidden;text-overflow:ellipsis}
.ticker div:last-child{border-bottom:none}
/* ── Table ── */
.wrap{overflow:auto;border:1px solid var(--line);border-radius:8px;max-height:420px}
table{width:100%;border-collapse:collapse;font-size:12px}
thead{position:sticky;top:0}
th{text-align:left;color:var(--dim);font-weight:500;padding:7px 10px;
  border-bottom:1px solid var(--line);background:#0b1520;font-size:11px;letter-spacing:.3px}
td{padding:5px 10px;border-bottom:1px solid #111d29;vertical-align:top}
td.det{word-break:break-all;color:#e6edf3}
tr.hot td{background:#1a0f10}
.badge{padding:1px 7px;border-radius:4px;font-size:10px;font-weight:700;color:#060c12}
.empty{padding:24px;text-align:center;color:var(--dim);font-size:12px}
/* ── Tools bar ── */
.tools{display:flex;flex-wrap:wrap;gap:5px;margin-bottom:8px;align-items:center}
.btn{background:var(--card2);color:var(--txt);border:1px solid var(--line);
  padding:5px 12px;border-radius:7px;cursor:pointer;font:inherit;font-size:11.5px;transition:border-color .15s}
.btn.on{border-color:var(--blue);color:var(--blue)}
.btn:hover{border-color:var(--blue)}
.inp{background:var(--card2);border:1px solid var(--line);color:var(--txt);
  padding:5px 11px;border-radius:7px;font:inherit;font-size:11.5px;flex:1;min-width:130px;outline:none}
.inp:focus{border-color:var(--blue)}
/* ── Battery card ── */
.bat-bar-wrap{background:#0b1520;border:1px solid var(--line);border-radius:6px;
  height:22px;overflow:hidden;margin:10px 0 6px}
.bat-bar-fill{height:100%;border-radius:5px;transition:width .5s,background .5s;min-width:2px}
.bat-row{display:flex;justify-content:space-between;font-size:12px;margin:3px 0}
.bat-k{color:var(--dim)}.bat-v{font-weight:600}
/* ── Section title ── */
.sec{font-size:11px;font-weight:600;text-transform:uppercase;letter-spacing:.8px;
  color:var(--dim);margin:14px 0 8px}
/* ── Sys info ── */
.sinfo{display:grid;grid-template-columns:1fr 1fr;gap:6px}
.srow{background:#0b1520;border:1px solid var(--line);border-radius:7px;padding:8px 11px}
.srow .sk{font-size:10px;color:var(--dim);text-transform:uppercase;letter-spacing:.5px}
.srow .sv{font-size:14px;font-weight:600;margin-top:2px}
footer{padding:10px 18px;color:var(--dim);font-size:11px;border-top:1px solid var(--line);
  display:flex;gap:14px;flex-wrap:wrap}
a{color:var(--blue);text-decoration:none}
a:hover{text-decoration:underline}
.page{display:none}.page.active{display:block}
</style></head><body>
<header>
  <div><div class=logo>VERA</div><div class=logo-sub>Cyber Defense Node</div></div>
  <span class=pill id=pSd>storage</span>
  <span class=pill id=pBat>battery</span>
  <div class=hdr-right>
    <span class=pill id=pIp>ip</span>
    <span class=pill id=pUp>uptime</span>
    <span class=pill id=pRssi>rssi</span>
    <span class=pill id=pHeap>heap</span>
    <span class=pill id=pSeen style=color:#3fb950>●</span>
  </div>
</header>
<nav>
  <div class="tab active" onclick=showTab(0)>Overview</div>
  <div class=tab onclick=showTab(1)>Threat Log</div>
  <div class=tab onclick=showTab(2)>Attackers</div>
  <div class=tab onclick=showTab(3)>Captured Loot</div>
  <div class=tab onclick=showTab(4)>System</div>
</nav>
<main>
<!-- TAB 0: OVERVIEW -->
<div class="page active" id=t0>
  <div class=grid>
    <div class="card telnet"><div class=lbl>Telnet (23)</div><div class=val id=cTelnet>0</div></div>
    <div class="card ssh"><div class=lbl>SSH (22)</div><div class=val id=cSsh>0</div></div>
    <div class="card ftp"><div class=lbl>FTP (21)</div><div class=val id=cFtp>0</div></div>
    <div class="card http"><div class=lbl>HTTP (80)</div><div class=val id=cHttp>0</div></div>
    <div class="card ping"><div class=lbl>Ping (ICMP)</div><div class=val id=cPing>0</div></div>
  </div>
  <div class=grid>
    <div class=card><div class=lbl>Total Probes</div><div class=val id=cTotal>0</div></div>
    <div class=card><div class=lbl>Unique Hosts</div><div class=val id=cIps>0</div></div>
    <div class="card cred"><div class=lbl>Creds Harvest</div><div class=val id=cCreds>0</div></div>
    <div class="card cred"><div class=lbl>Shell Payloads</div><div class=val id=cPayl>0</div></div>
    <div class="card scan"><div class=lbl>Port Scanners</div><div class=val id=cScans>0</div></div>
  </div>
  <div class=row2>
    <div class=panel>
      <div class=panel-title>Service Attack Distribution</div>
      <div id=bars></div>
    </div>
    <div class=panel>
      <div class=panel-title>Latest Threat Feed</div>
      <div class=ticker id=ticker><div style=color:var(--dim)>[--:--:--] System Armed. Awaiting inbound probes...</div></div>
    </div>
  </div>
</div>
<!-- TAB 1: THREAT LOG -->
<div class=page id=t1>
  <div class=tools>
    <button class="btn on" data-f=ALL>All</button>
    <button class=btn data-f=TELNET>Telnet</button>
    <button class=btn data-f=SSH>SSH</button>
    <button class=btn data-f=FTP>FTP</button>
    <button class=btn data-f=HTTP>HTTP</button>
    <button class=btn data-f=PING>Ping</button>
    <button class=btn data-f=HOT>Alerts Only</button>
    <input class=inp id=q placeholder="Filter by IP, service, or keyword…">
    <button class=btn id=pauseBtn>Pause</button>
  </div>
  <div class=wrap><table><thead><tr>
    <th style=width:78px>Time</th><th style=width:72px>Service</th>
    <th style=width:165px>Source IP &amp; MAC</th><th>Detail</th>
  </tr></thead><tbody id=evBody></tbody></table></div>
</div>
<!-- TAB 2: ATTACKERS -->
<div class=page id=t2>
  <div class=wrap style=max-height:none><table><thead><tr>
    <th>Source IP</th><th>MAC Address</th><th>Services Touched</th><th>Threat Level</th>
  </tr></thead><tbody id=ipBody></tbody></table></div>
</div>
<!-- TAB 3: LOOT -->
<div class=page id=t3>
  <div class=sec>Captured Credentials</div>
  <div class=wrap><table><thead><tr>
    <th>Time</th><th>Service</th><th>Source IP</th><th>Username</th><th>Password</th>
  </tr></thead><tbody id=credBody></tbody></table></div>
  <div class=sec>Shell Payloads</div>
  <div class=wrap><table><thead><tr>
    <th>Time</th><th>Service</th><th>Source IP</th><th>Command</th>
  </tr></thead><tbody id=paylBody></tbody></table></div>
</div>
<!-- TAB 4: SYSTEM -->
<div class=page id=t4>
  <div class=row2>
    <div class=panel>
      <div class=panel-title>Power &amp; Battery Subsystem</div>
      <div class=bat-bar-wrap><div class=bat-bar-fill id=batFill style=width:0%></div></div>
      <div class=bat-row><span class=bat-k>Voltage</span><span class=bat-v id=batV>-- V</span></div>
      <div class=bat-row><span class=bat-k>Charge Level</span><span class=bat-v id=batPct>--%</span></div>
      <div class=bat-row><span class=bat-k>Status</span><span class=bat-v id=batStat>Reading...</span></div>
      <div style=margin-top:10px;font-size:10.5px;color:var(--dim);line-height:1.7>
        MANAGEMENT IC: CS8501 580mA Charge / 5V Boost<br>
        BATTERY SOCKET: PH2.0 (Single-Cell 3.7V Li-ion)<br>
        MONITOR ADC: CH32V003 Register 0x06 (3:1 Divider)
      </div>
    </div>
    <div class=panel>
      <div class=panel-title>System &amp; Network</div>
      <div class=sinfo>
        <div class=srow><div class=sk>IP Address</div><div class=sv id=sIp>--</div></div>
        <div class=srow><div class=sk>Signal (RSSI)</div><div class=sv id=sRssi>-- dBm</div></div>
        <div class=srow><div class=sk>Free Heap</div><div class=sv id=sHeap>-- kB</div></div>
        <div class=srow><div class=sk>Uptime</div><div class=sv id=sUp>--</div></div>
        <div class=srow><div class=sk>Boot Count</div><div class=sv id=sBoots>--</div></div>
        <div class=srow><div class=sk>MicroSD</div><div class=sv id=sSd>--</div></div>
      </div>
    </div>
  </div>
  <div class=panel style="margin-top:10px">
    <div class=panel-title>Wi-Fi Network Configuration &amp; Connect</div>
    <div style="display:flex;gap:10px;flex-wrap:wrap;align-items:center;margin-bottom:10px">
      <button class=btn id=btnScanWifi onclick=scanWifi()>🔍 Scan Networks</button>
      <select id=selWifi onchange="pickWifi(this.value)" class=inp style="max-width:240px">
        <option value="">-- Scanned APs --</option>
      </select>
      <input id=wSsid class=inp placeholder="SSID (Network Name)" style="max-width:220px">
      <input id=wPass class=inp type=password placeholder="Password" style="max-width:200px">
      <button class=btn style="background:#238636;border-color:#2ea043;color:#fff;font-weight:600" onclick=connectWifi()>Connect Wi-Fi</button>
    </div>
    <div id=wMsg style="font-size:12px;color:var(--dim)">Current Wi-Fi: <b id=wCurSsid>--</b> &middot; Status: <span id=wCurStat style="color:#3fb950">Online</span></div>
  </div>
</div>
</main>
<footer>
  VERA v2.0 &nbsp;&middot;&nbsp;
  <a id=lnkRaw href=#>Download full log</a> &nbsp;&middot;&nbsp;
  <a id=lnkClear href=# style=color:var(--cred)>Clear all data</a>
</footer>
<script>
var KEY=new URLSearchParams(location.search).get('key')||'';
try{if(!KEY)KEY=sessionStorage.getItem('vera_key')||'';else sessionStorage.setItem('vera_key',KEY);}catch(e){}
var COL={TELNET:'--telnet',SSH:'--ssh',FTP:'--ftp',HTTP:'--http',PING:'--ping',SCAN:'--scan',SYS:'--sys'};
var filter='ALL',live=true,rows=[],curTab=0;
document.getElementById('lnkRaw').href='/raw?key='+encodeURIComponent(KEY);
document.getElementById('lnkClear').onclick=function(e){e.preventDefault();
  if(confirm('Erase the whole log and all counters?'))
    fetch('/clear?key='+encodeURIComponent(KEY)).then(function(){location.reload();});};
// Tab switching
function showTab(n){
  document.querySelectorAll('.page').forEach(function(p,i){p.classList.toggle('active',i===n);});
  document.querySelectorAll('.tab').forEach(function(t,i){t.classList.toggle('active',i===n);});
  curTab=n;
}
// Wi-Fi Management
function scanWifi(){
  var b=document.getElementById('btnScanWifi');
  if(b){b.disabled=true;b.textContent='Scanning...';}
  var s=document.getElementById('selWifi');
  s.innerHTML='<option>Scanning 2.4GHz networks...</option>';
  fetch('/wifi/scan?key='+encodeURIComponent(KEY)).then(function(r){
    if(!r.ok) throw new Error('HTTP '+r.status);
    return r.json();
  })
  .then(function(d){
    if(b){b.disabled=false;b.textContent='🔍 Scan Networks';}
    if(!d.nets || !d.nets.length){
      s.innerHTML='<option value="">-- No APs found --</option>';
      return;
    }
    s.innerHTML='<option value="">-- Select AP ('+d.nets.length+' found) --</option>';
    d.nets.forEach(function(n){
      var o=document.createElement('option');
      o.value=n.ssid;
      o.textContent=n.ssid+' ('+n.rssi+' dBm)';
      s.appendChild(o);
    });
  }).catch(function(e){
    if(b){b.disabled=false;b.textContent='🔍 Scan Networks';}
    s.innerHTML='<option>Scan failed ('+(e.message||'error')+'). Tap to retry.</option>';
  });
}
function pickWifi(v){
  if(v){
    document.getElementById('wSsid').value=v;
    var p=document.getElementById('wPass');
    p.value='';
    p.focus();
  }
}
function connectWifi(){
  var s=document.getElementById('wSsid').value.trim();
  var p=document.getElementById('wPass').value;
  if(!s){alert('Please enter or select an SSID');return;}
  var m=document.getElementById('wMsg');
  m.innerHTML='<span style="color:#d29922">Connecting to <b>'+esc(s)+'</b>... (device will switch networks)</span>';
  fetch('/wifi/connect?key='+encodeURIComponent(KEY)+'&ssid='+encodeURIComponent(s)+'&pass='+encodeURIComponent(p))
    .then(function(r){
      if(!r.ok) throw new Error('HTTP '+r.status);
      return r.json();
    })
    .then(function(d){
      m.innerHTML='<span style="color:#3fb950">'+esc(d.msg)+'</span>';
    }).catch(function(){
      m.innerHTML='<span style="color:#58a6ff">Reconnection in progress. Check device screen for new IP address.</span>';
    });
}
var wp=document.getElementById('wPass');
if(wp) wp.addEventListener('keydown',function(e){if(e.key==='Enter')connectWifi();});

// Filter buttons
document.querySelectorAll('button[data-f]').forEach(function(b){
  b.onclick=function(){filter=b.dataset.f;
    document.querySelectorAll('button[data-f]').forEach(function(x){x.classList.toggle('on',x===b)});draw();};});
document.getElementById('q').oninput=draw;
document.getElementById('pauseBtn').onclick=function(){live=!live;this.textContent=live?'Pause':'Resume';this.classList.toggle('on',!live);};
function esc(t){return (t||'').replace(/[<>&]/g,function(c){return {'<':'&lt;','>':'&gt;','&':'&amp;'}[c]});}
function hot(sv,d){return sv==='SCAN'||/^(CREDS|PAYLOAD|PROBE)/.test(d);}
function svcName(m){var o=[];if(m&1)o.push('Telnet');if(m&2)o.push('SSH');if(m&4)o.push('FTP');if(m&8)o.push('HTTP');if(m&16)o.push('Ping');return o.join(', ')||'—';}
function draw(){
  var q=(document.getElementById('q').value||'').toLowerCase();
  var out=rows.filter(function(r){
    if(filter==='HOT'&&!hot(r[1],r[3]))return false;
    if(filter!=='ALL'&&filter!=='HOT'&&r[1]!==filter)return false;
    if(q&&(r.join(' ').toLowerCase().indexOf(q)<0))return false;
    return true;}).slice(-400).reverse();
  var b=document.getElementById('evBody');
  if(!b)return;
  if(!out.length){b.innerHTML='<tr><td colspan=4 class=empty>No matching events</td></tr>';return;}
  b.innerHTML=out.map(function(r){
    var c=COL[r[1]]||'--sys';
    var isHot=hot(r[1],r[3]);
    var macInfo=(r[5]&&r[5]!=='--')?'<div style="font-size:11px;color:#8b949e;font-family:monospace">'+esc(r[5])+'</div>':'';
    return '<tr class="'+(isHot?'hot':'')+'"><td>'+esc(r[0])+
    '</td><td><span class=badge style="background:var('+c+');color:#060c12">'+esc(r[1])+
    '</span></td><td><b>'+esc(r[2])+'</b>'+macInfo+'</td><td class=det>'+esc(r[3])+'</td></tr>';
  }).join('');}
function bars(d){
  var S=[['TELNET',d.telnet||0,'--telnet'],['SSH',d.ssh||0,'--ssh'],['FTP',d.ftp||0,'--ftp'],['HTTP',d.http||0,'--http'],['PING',d.ping||0,'--ping']];
  var mx=Math.max(1,d.telnet||0,d.ssh||0,d.ftp||0,d.http||0,d.ping||0);
  var el=document.getElementById('bars');
  if(!el)return;
  el.innerHTML=S.map(function(x){
    var pct=(x[1]>0)?Math.max(4,Math.round(x[1]/mx*100)):0;
    return '<div class=bar><span class=bl>'+x[0]+'</span><span class=bt>'+
    '<span class=bf style="display:block;height:100%;width:'+pct+'%;background:var('+x[2]+')"></span>'+
    '</span><span class=bn>'+x[1]+'</span></div>';}).join('');}
function fmtUp(s){var d=Math.floor(s/86400),h=Math.floor(s%86400/3600),m=Math.floor(s%3600/60);return (d?d+'d ':'')+(h?h+'h ':'')+m+'m';}
function updateTicker(evs){
  var t=document.getElementById('ticker');
  if(!t)return;
  var last=evs.slice(-5).reverse();
  if(!last.length){
    t.innerHTML='<div style="color:var(--dim)">[--:--:--] System Armed. Awaiting inbound probes...</div>';
    return;
  }
  t.innerHTML=last.map(function(r){
    var c=COL[r[1]]||'--sys';
    var macSuffix=(r[5]&&r[5]!=='--')?' ['+esc(r[5])+']':'';
    return '<div style=color:var('+c+')>['+esc(r[0])+'] <b>'+esc(r[1])+'</b> '+esc(r[2])+macSuffix+' &mdash; '+esc(r[3])+'</div>';
  }).join('');}
function batColor(pct,chg){if(chg)return'#3fb950';if(pct<=5)return'#f85149';if(pct<=15)return'#f0883e';return'#58a6ff';}
function poll(){
  if(!live)return;
  fetch('/api?key='+encodeURIComponent(KEY)).then(function(r){
    if(!r.ok) throw new Error('HTTP '+r.status);
    return r.json();
  })
  .then(function(d){
    // Metric cards
    ['telnet','ssh','ftp','http','ping','total','creds','scans','boots'].forEach(function(k){
      var e=document.getElementById('c'+k[0].toUpperCase()+k.slice(1));if(e)e.textContent=d[k];});
    document.getElementById('cPayl').textContent=d.payloads;
    document.getElementById('cIps').textContent=(d.ips?d.ips.length:0);

    // Header pills
    var sd=document.getElementById('pSd');
    if(sd){sd.textContent=d.sd?'microSD OK':'RAM Mode (No SD)';sd.className='pill '+(d.sd?'ok':'warn');}
    var bat=document.getElementById('pBat');
    if(d.bat&&bat){
      var bi=d.bat.chg?'⚡':(d.bat.pct>15?'🔋':(d.bat.pct>0?'🪫':'🔌'));
      bat.textContent=bi+' '+d.bat.stat+' ('+d.bat.v+'V)';
      bat.className='pill '+(d.bat.chg?'chg':(d.bat.pct<=5?'bad':(d.bat.pct<=15?'warn':'')));
    }
    document.getElementById('pIp').textContent=d.ip;
    document.getElementById('pUp').textContent='⏱ '+fmtUp(d.up);
    document.getElementById('pRssi').textContent=d.rssi+'dBm';
    document.getElementById('pHeap').textContent=Math.round(d.heap/1024)+'k free';
    document.getElementById('pSeen').style.color='#3fb950';
    document.getElementById('pSeen').title='Last updated: '+new Date().toLocaleTimeString();

    // 1. Service distribution bars
    bars(d);

