pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
    // 2. Attackers tab with MAC Address and Threat Level
    var ib=document.getElementById('ipBody');
    if(ib){
      ib.innerHTML=(d.ips&&d.ips.length)?d.ips.map(function(x){
        var isHot=!!x.f;
        var flagBadge=isHot?
          '<span class=badge style="background:var(--scan);color:#060c12">PORT SCANNER (FLAGGED)</span>':
          '<span class=badge style="background:#21262d;color:#8b949e">PROBING</span>';
        var macStr=x.mac||'--';
        return '<tr class="'+(isHot?'hot':'')+'"><td><b>'+esc(x.a)+'</b></td><td><code style="color:#58a6ff;font-size:12px;font-family:monospace">'+esc(macStr)+'</code></td><td>'+svcName(x.m)+
        '</td><td>'+flagBadge+'</td></tr>';
      }).join(''):'<tr><td colspan=4 class=empty>No attackers detected yet</td></tr>';
    }

    // 3. Loot (creds and payloads)
    var cb=document.getElementById('credBody');
    var cl=d.creds_list||[];
    if(cb){
      cb.innerHTML=cl.length?cl.slice().reverse().map(function(r){
        return '<tr><td>'+esc(r.t)+'</td><td><span class=badge style="background:var(--cred)">'+esc(r.s)+'</span></td><td>'+esc(r.a)+'</td><td><b>'+esc(r.u)+'</b></td><td>'+esc(r.p)+'</td></tr>';
      }).join(''):'<tr><td colspan=5 class=empty>No credentials captured yet</td></tr>';
    }
    var pb=document.getElementById('paylBody');
    var pl=d.payloads_list||[];
    if(pb){
      pb.innerHTML=pl.length?pl.slice().reverse().map(function(r){
        return '<tr><td>'+esc(r.t)+'</td><td><span class=badge style="background:var(--cred)">'+esc(r.s)+'</span></td><td>'+esc(r.a)+'</td><td class=det><code>'+esc(r.c)+'</code></td></tr>';
      }).join(''):'<tr><td colspan=4 class=empty>No payloads captured yet</td></tr>';
    }

    // 4. Events -> Threat Feed Ticker & Threat Log Table
    if(d.events&&d.events.length){
      rows=d.events.map(function(e){return [e.t,e.s,e.a,e.d,e.h,e.mac||'--'];});
      draw();
      updateTicker(rows);
    }

    // 5. Battery and system tab
    if(d.bat){
      var bc=batColor(d.bat.pct,d.bat.chg);
      document.getElementById('batFill').style.cssText='width:'+d.bat.pct+'%;background:'+bc;
      document.getElementById('batV').textContent=d.bat.v+' V';
      document.getElementById('batPct').textContent=d.bat.pct+'%';
      document.getElementById('batStat').textContent=d.bat.stat;
      document.getElementById('batStat').style.color=bc;
    }
    document.getElementById('sIp').textContent=d.ip;
    document.getElementById('sRssi').textContent=d.rssi+' dBm';
    document.getElementById('sHeap').textContent=Math.round(d.heap/1024)+' kB';
    document.getElementById('sUp').textContent=fmtUp(d.up);
    document.getElementById('sBoots').textContent=d.boots;
    document.getElementById('sSd').textContent=d.sd?'Card OK — FAT32':'RAM Mode (No SD)';
    if(d.ssid){
      var ws=document.getElementById('wCurSsid');if(ws)ws.textContent=d.ssid;
      var st=document.getElementById('wCurStat');if(st){st.textContent=d.ssid==='Offline'?'Offline':'Connected';st.style.color=d.ssid==='Offline'?'var(--cred)':'#3fb950';}
    }
  }).catch(function(){document.getElementById('pSeen').style.color='var(--cred)';});
}
poll();setInterval(poll,2500);
</script></body></html>)HTML";

/* ── Wi-Fi Configuration State & UI Handles ── */
static char wifiPendingSsid[64] = "";
static char wifiPendingPass[64] = "";
static volatile bool wifiIsScanning = false;
static volatile bool wifiIsConnecting = false;

static lv_obj_t *lblWifiStatus = nullptr;
static lv_obj_t *lblWifiCur = nullptr;
static lv_obj_t *lblWifiPill = nullptr;
static lv_obj_t *ddWifiSsid = nullptr;
static lv_obj_t *taWifiSsid = nullptr;
static lv_obj_t *taWifiPass = nullptr;
static lv_obj_t *btnWifiScan = nullptr;
static lv_obj_t *lblWifiScanBtn = nullptr;
static lv_obj_t *btnWifiShowPass = nullptr;
static lv_obj_t *lblWifiShowPassBtn = nullptr;
static lv_obj_t *btnWifiConnect = nullptr;
static lv_obj_t *lblWifiConnBtn = nullptr;
static lv_obj_t *cardWifi = nullptr;
static lv_obj_t *lblWifiTitle = nullptr;

// On-screen capacitive virtual keyboard modal & live preview bar
static lv_obj_t *kbModal = nullptr;
static lv_obj_t *lblKbPrompt = nullptr;
static lv_obj_t *taKbInput = nullptr;
static lv_obj_t *btnKbShowPass = nullptr;
static lv_obj_t *lblKbShowPass = nullptr;
static lv_obj_t *btnKbDone = nullptr;
static lv_obj_t *btnKbCancel = nullptr;
static lv_obj_t *kbWifi = nullptr;
static lv_obj_t *activeTargetTa = nullptr;

void wifiScanTask(void *param) {
  wifiIsScanning = true;
  Serial.println("[WIFI] Manual AP scan initiated...");

  if (esp_lv_adapter_lock(-1)) {
    if (lblWifiStatus) {
      lv_label_set_text(lblWifiStatus, "Scanning 2.4GHz Wi-Fi networks...");
      lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0xD29922), 0);
    }
    if (lblWifiScanBtn) {
      lv_label_set_text(lblWifiScanBtn, "Scanning...");
    }
    esp_lv_adapter_unlock();
  }

  // 1. Ensure WiFi hardware is awake and in STA mode with RAM-only storage
  WiFi.persistent(false);
  WiFi.setAutoReconnect(false);
  esp_wifi_set_storage(WIFI_STORAGE_RAM);
  if (!(WiFi.getMode() & WIFI_STA)) {
    WiFi.mode(WIFI_STA);
    esp_wifi_set_storage(WIFI_STORAGE_RAM);
    delay(60);
  }

  // 2. Disconnect any active link without de-initializing the network interface
  esp_wifi_disconnect();
  delay(100);

  // 3. Clear any previous scan buffer
  WiFi.scanDelete();

  // 4. Perform synchronous scan (running inside this FreeRTOS task)
  int16_t n = WiFi.scanNetworks(false, false, false, 300);
  Serial.printf("[WIFI] Initial scan returned: %d APs\n", n);

  // If radio was busy or state was transient, retry once after a brief rest
  if (n < 0) {
    Serial.println("[WIFI] Scan returned error code, retrying scan...");
    esp_wifi_disconnect();
    delay(150);
    WiFi.scanDelete();
    n = WiFi.scanNetworks(false, false, false, 300);
    Serial.printf("[WIFI] Retry scan returned: %d APs\n", n);
  }

  if (esp_lv_adapter_lock(-1)) {
    if (lblWifiScanBtn) {
      lv_label_set_text(lblWifiScanBtn, "🔍 Scan APs");
    }
    if (n < 0) {
      if (lblWifiStatus) {
        lv_label_set_text(lblWifiStatus, "Scan failed. Please tap 'Scan APs' again.");
        lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0xF85149), 0);
      }
    } else if (n == 0) {
      if (lblWifiStatus) {
        lv_label_set_text(lblWifiStatus, "No 2.4GHz Wi-Fi networks found.");
        lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0xD29922), 0);
      }
      if (ddWifiSsid) {
        lv_dropdown_set_options(ddWifiSsid, "-- No networks detected --");
      }
    } else {
      String apList = "";
      for (int i = 0; i < n; i++) {
        String s = WiFi.SSID(i);
        if (s.length() == 0) continue; // Skip hidden/empty SSIDs
        String checkStr = s + " (";
        if (apList.indexOf(checkStr) >= 0) continue; // Deduplicate

        if (apList.length() > 0) apList += "\n";
        apList += s + " (" + String(WiFi.RSSI(i)) + "dBm)";
        Serial.printf("   [AP #%d] %s (%d dBm)\n", i, s.c_str(), WiFi.RSSI(i));
      }
      if (apList.length() == 0) {
        apList = "-- No broadcasted SSIDs --";
      }
      if (ddWifiSsid) {
        lv_dropdown_set_options(ddWifiSsid, apList.c_str());
      }
      if (lblWifiStatus) {
        char sbuf[64];
        snprintf(sbuf, sizeof(sbuf), "Found %d networks. Select AP or type SSID.", n);
        lv_label_set_text(lblWifiStatus, sbuf);
        lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0x3FB950), 0);
      }
    }
    esp_lv_adapter_unlock();
  }

