pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  wifiIsScanning = false;
  vTaskDelete(NULL);
}

void wifiConnectTask(void *param) {
  wifiIsConnecting = true;
  Serial.printf("[WIFI] Connecting to '%s'...\n", wifiPendingSsid);
  if (esp_lv_adapter_lock(-1)) {
    if (lblWifiStatus) {
      char sbuf[96];
      snprintf(sbuf, sizeof(sbuf), "Connecting to '%s'...", wifiPendingSsid);
      lv_label_set_text(lblWifiStatus, sbuf);
      lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0xD29922), 0);
    }
    esp_lv_adapter_unlock();
  }

  // Ensure RAM-only storage so IDF never writes flash (prevents cache disable panics)
  WiFi.persistent(false);
  WiFi.setAutoReconnect(false);
  esp_wifi_set_storage(WIFI_STORAGE_RAM);
  esp_wifi_disconnect();
  delay(100);

  WiFi.mode(WIFI_STA);
  esp_wifi_set_storage(WIFI_STORAGE_RAM);
  WiFi.begin(wifiPendingSsid, wifiPendingPass);

  uint32_t t0 = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - t0) < 12000) {
    delay(250);
  }

  if (esp_lv_adapter_lock(-1)) {
    if (WiFi.status() == WL_CONNECTED) {
      Serial.printf("[WIFI] Connected! IP: %s\n", WiFi.localIP().toString().c_str());
      saveWifiConfig(wifiPendingSsid, wifiPendingPass);
      if (lblWifiStatus) {
        char sbuf[96];
        snprintf(sbuf, sizeof(sbuf), "Connected! IP: %s (%ddBm)",
                 WiFi.localIP().toString().c_str(), WiFi.RSSI());
        lv_label_set_text(lblWifiStatus, sbuf);
        lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0x3FB950), 0);
      }
      if (lblWifiCur) {
        char cbuf[96];
        snprintf(cbuf, sizeof(cbuf), "SSID: %s  |  IP: %s (%ddBm)",
                 WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
        lv_label_set_text(lblWifiCur, cbuf);
      }
      if (lblWifiPill) {
        char pbuf[32];
        snprintf(pbuf, sizeof(pbuf), "%s (%ddBm)", WiFi.SSID().c_str(), WiFi.RSSI());
        lv_label_set_text(lblWifiPill, pbuf);
      }
      configTime(GMT_OFFSET_SEC, DST_OFFSET_SEC, "pool.ntp.org", "time.nist.gov");
      ntpConfigured = true;
    } else {
      Serial.printf("[WIFI] Connection to '%s' failed.\n", wifiPendingSsid);
      if (lblWifiStatus) {
        char sbuf[96];
        snprintf(sbuf, sizeof(sbuf), "Connection failed. Check credentials.");
        lv_label_set_text(lblWifiStatus, sbuf);
        lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0xF85149), 0);
      }
    }
    esp_lv_adapter_unlock();
  }
  wifiIsConnecting = false;
  vTaskDelete(NULL);
}

void handleAdmin() {
  WiFiClient c = srvAccept(srvAdmin);
  if (!c) return;
  String req;
  uint32_t t0 = millis();
  while ((millis() - t0) < 1500 && c.connected()) {
    if (c.available()) {
      char ch = c.read();
      if (ch == '\n') break;
      req += ch;
    } else {
      delay(2);
    }
  }
  while (c.available()) c.read();

  // ── Serve login page at / (no key required) ──
  bool isRoot = (req.indexOf("GET / ") >= 0 || req.indexOf("GET /\r") >= 0);
  if (isRoot && req.indexOf(ADMIN_KEY) < 0) {
    c.print("HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
    c.print(LOGIN_HTML);
    c.flush();
    delay(15); c.stop(); return;
  }

  // ── All other routes require the key ──
  if (req.indexOf(ADMIN_KEY) < 0) {
    c.print("HTTP/1.1 403 Forbidden\r\nConnection: close\r\n\r\nnope\r\n");
    c.flush();
    delay(5); c.stop(); return;
  }

  // ── /api ──
  if (req.indexOf("/api") >= 0) {
    String j = "{";
    j += "\"sd\":";       j += (sdOk ? "true" : "false");
    j += ",\"ip\":\"" + WiFi.localIP().toString() + "\"";
    j += ",\"rssi\":"   + String(WiFi.RSSI());
    j += ",\"heap\":"   + String(ESP.getFreeHeap());
    j += ",\"ssid\":\"" + escapeJson(WiFi.status() == WL_CONNECTED ? WiFi.SSID() : String("Offline")) + "\"";
    j += ",\"up\":"     + String(millis() / 1000);
    j += ",\"boots\":"  + String(st.boots);
    j += ",\"telnet\":" + String(st.telnet);
    j += ",\"ssh\":"    + String(st.ssh);
    j += ",\"ftp\":"    + String(st.ftp);
    j += ",\"http\":"   + String(st.http);
    j += ",\"ping\":"   + String(st.ping);
    j += ",\"total\":"  + String(st.total);
    j += ",\"creds\":"  + String(st.creds);
    j += ",\"payloads\":" + String(st.payloads);
    j += ",\"scans\":"  + String(st.scans);
    j += ",\"bat\":{\"v\":" + String(curBat.voltage, 2) +
         ",\"pct\":" + String(curBat.percent) +
         ",\"chg\":" + (curBat.charging ? "true" : "false") +
         ",\"stat\":\"" + escapeJson(curBat.status) + "\"}";
    j += ",\"ips\":[";
    for (uint8_t i = 0; i < ipCount; i++) {
      IPAddress a(ipTab[i].ip);
      if (i) j += ",";
      j += "{\"a\":\"" + a.toString() + "\",\"mac\":\"" + escapeJson(ipTab[i].mac[0] ? ipTab[i].mac : "--") + "\",\"m\":" + String(ipTab[i].mask) +
           ",\"f\":" + String(ipTab[i].flagged ? "true" : "false") + "}";
    }
    j += "]";
    // Captured credentials
    j += ",\"creds_list\":[";
    for (uint8_t i = 0; i < credCount; i++) {
      if (i) j += ",";
      j += "{\"t\":\"" + escapeJson(credTab[i].time) + "\",\"s\":\"" + escapeJson(credTab[i].svc) +
           "\",\"a\":\"" + escapeJson(credTab[i].ip)  + "\",\"u\":\"" + escapeJson(credTab[i].user) +
           "\",\"p\":\"" + escapeJson(credTab[i].pass) + "\"}";
    }
    j += "]";
    // Captured payloads
    j += ",\"payloads_list\":[";
    for (uint8_t i = 0; i < payloadCount; i++) {
      if (i) j += ",";
      j += "{\"t\":\"" + escapeJson(payloadTab[i].time) + "\",\"s\":\"" + escapeJson(payloadTab[i].svc) +
           "\",\"a\":\"" + escapeJson(payloadTab[i].ip)  + "\",\"c\":\"" + escapeJson(payloadTab[i].cmd) + "\"}";
    }
    j += "]";
    // Events list
    j += ",\"events\":[";
    for (uint8_t i = 0; i < logCount; i++) {
      if (i) j += ",";
      j += "{\"t\":\"" + escapeJson(logEntries[i].time) + "\",\"s\":\"" + escapeJson(logEntries[i].svc) +
           "\",\"a\":\"" + escapeJson(logEntries[i].ip) + "\",\"mac\":\"" + escapeJson(logEntries[i].mac[0] ? logEntries[i].mac : "--") + "\",\"d\":\"" + escapeJson(logEntries[i].detail) +
           "\",\"h\":" + (logEntries[i].isAlert ? "true" : "false") + "}";
    }
    j += "]}";
    c.print("HTTP/1.1 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
    c.print(j);
    c.flush();
    delay(10); c.stop(); return;
  }

  // ── /loot — JSON array of captured credentials and payloads ──
  if (req.indexOf("/loot") >= 0) {
    String j = "{\"creds\":[";
    for (uint8_t i = 0; i < credCount; i++) {
      if (i) j += ",";
      j += "{\"t\":\"" + escapeJson(credTab[i].time) + "\",\"s\":\"" + escapeJson(credTab[i].svc) +
           "\",\"a\":\"" + escapeJson(credTab[i].ip)  + "\",\"u\":\"" + escapeJson(credTab[i].user) +
           "\",\"p\":\"" + escapeJson(credTab[i].pass) + "\"}";
    }
    j += "],\"payloads\":[";
    for (uint8_t i = 0; i < payloadCount; i++) {
      if (i) j += ",";
      j += "{\"t\":\"" + escapeJson(payloadTab[i].time) + "\",\"s\":\"" + escapeJson(payloadTab[i].svc) +
           "\",\"a\":\"" + escapeJson(payloadTab[i].ip)  + "\",\"c\":\"" + escapeJson(payloadTab[i].cmd) + "\"}";
    }
    j += "]}";
    c.print("HTTP/1.1 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
    c.print(j);
    c.flush();
    delay(10); c.stop(); return;
  }

  // ── /tail ──
  if (req.indexOf("/tail") >= 0) {
    c.print("HTTP/1.1 200 OK\r\nContent-Type: text/plain\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
    bool sentAny = false;
    if (sdOk && SD_MMC.exists(LOG_PATH)) {
      fs::File f = SD_MMC.open(LOG_PATH, FILE_READ);
      if (f && f.size() > 0) {
        sentAny = true;
        const size_t WANT = 14000;
        if ((size_t)f.size() > WANT) {
          f.seek(f.size() - WANT);
          while (f.available()) { if (f.read() == '\n') break; }
        }
        uint8_t buf[256];
        while (f.available()) { size_t n = f.read(buf, 256); c.write(buf, n); }
        f.close();
      }
    }
    if (!sentAny) {
      for (uint8_t i = 0; i < logCount; i++) {
        c.printf("%s\t%s\t%s\t%s\t%s\n", logEntries[i].time, logEntries[i].svc, logEntries[i].ip, logEntries[i].mac[0] ? logEntries[i].mac : "--", logEntries[i].detail);
      }
    }
    c.flush();
    delay(10); c.stop(); return;
  }

