pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // ── /raw ──
  if (req.indexOf("/raw") >= 0) {
    c.print("HTTP/1.1 200 OK\r\nContent-Type: text/plain\r\nContent-Disposition: attachment; filename=vera.tsv\r\nConnection: close\r\n\r\n");
    if (sdOk && SD_MMC.exists(LOG_PATH)) {
      fs::File f = SD_MMC.open(LOG_PATH, FILE_READ);
      if (f) {
        uint8_t buf[256];
        while (f.available()) { size_t n = f.read(buf, 256); c.write(buf, n); }
        f.close();
      }
    } else {
      for (uint8_t i = 0; i < logCount; i++) {
        c.printf("%s\t%s\t%s\t%s\t%s\n", logEntries[i].time, logEntries[i].svc, logEntries[i].ip, logEntries[i].mac[0] ? logEntries[i].mac : "--", logEntries[i].detail);
      }
    }
    c.flush();
    delay(10); c.stop(); return;
  }

  // ── /clear ──
  if (req.indexOf("/clear") >= 0) {
    if (sdOk) { SD_MMC.remove(LOG_PATH); SD_MMC.remove(STATE_PATH); }
    memset(&st, 0, sizeof(st));
    ipCount = 0; credCount = 0; payloadCount = 0; logCount = 0;
    updateDashboardMetrics(); updateIpTableUI(); updateLootUI();
    c.print("HTTP/1.1 200 OK\r\nContent-Type: text/plain\r\nConnection: close\r\n\r\ncleared\r\n");
    c.flush();
    delay(5); c.stop(); return;
  }

  // ── /wifi/scan ──
  if (req.indexOf("/wifi/scan") >= 0) {
    WiFi.scanDelete();
    int16_t n = WiFi.scanNetworks(false, false, false, 150);
    if (n < 0) {
      delay(80);
      WiFi.scanDelete();
      n = WiFi.scanNetworks(false, false, false, 150);
    }
    String j = "{\"nets\":[";
    int added = 0;
    for (int i = 0; i < n; i++) {
      String s = WiFi.SSID(i);
      if (s.length() == 0) continue;
      if (added > 0) j += ",";
      j += "{\"ssid\":\"" + escapeJson(s) + "\",\"rssi\":" + String(WiFi.RSSI(i)) + "}";
      added++;
    }
    j += "]}";
    c.print("HTTP/1.1 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
    c.print(j);
    c.flush();
    delay(15); c.stop(); return;
  }

  // ── /wifi/connect ──
  if (req.indexOf("/wifi/connect") >= 0) {
    String nSsid = formField(req, "ssid");
    String nPass = formField(req, "pass");
    if (nSsid.length() > 0) {
      strncpy(wifiPendingSsid, nSsid.c_str(), sizeof(wifiPendingSsid) - 1);
      wifiPendingSsid[sizeof(wifiPendingSsid) - 1] = '\0';
      strncpy(wifiPendingPass, nPass.c_str(), sizeof(wifiPendingPass) - 1);
      wifiPendingPass[sizeof(wifiPendingPass) - 1] = '\0';
      c.print("HTTP/1.1 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
      c.print("{\"ok\":true,\"msg\":\"Connecting to " + escapeJson(nSsid) + "... Check device screen for IP.\"}");
      c.flush();
      delay(20); c.stop();
      xTaskCreate(wifiConnectTask, "w_conn", 6144, NULL, 1, NULL);
      return;
    } else {
      c.print("HTTP/1.1 400 Bad Request\r\nContent-Type: application/json\r\nConnection: close\r\n\r\n{\"ok\":false,\"msg\":\"Missing SSID\"}");
      c.flush();
      delay(10); c.stop();
      return;
    }
  }

  // ── /ui — full mirrored dashboard ──
  c.print("HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nCache-Control: no-store\r\nConnection: close\r\n\r\n");
  c.print(DASH_HTML);
  c.flush();
  delay(25); c.stop();
}


/*=================== 14. LVGL GUI DESIGN (1024x600) ============*/
static lv_obj_t *scr;
static lv_obj_t *hdr;
static lv_obj_t *tabview;
static lv_obj_t *lblTitle;
static lv_obj_t *btnTheme;
static lv_obj_t *lblThemeBtn;
static lv_obj_t *lblClock;
static lv_obj_t *lblBatteryPill;
static lv_obj_t *lblSdBadge;
static lv_obj_t *lblHeapPill;

/* Battery UI widgets in System Tab */
static lv_obj_t *barBattery;
static lv_obj_t *lblBatVoltageVal;
static lv_obj_t *lblBatPctVal;
static lv_obj_t *lblBatStatusVal;
static lv_obj_t *lblBatAdcVal;

/* UI Theme Tracking */
static lv_obj_t *btnThemeSettings;
static lv_obj_t *lblThemeSettingsBtn;
static lv_obj_t *lblThemeModeInfo;
static lv_obj_t *uiCards[24];
static uint8_t uiCardCount = 0;
static lv_obj_t *uiValLabels[24];
static uint8_t uiValLabelCount = 0;

struct MetricCardWidgets {
  lv_obj_t *card;
  lv_obj_t *lblTitle;
  lv_obj_t *lblVal;
  uint32_t darkColor;
  uint32_t lightColor;
};
static MetricCardWidgets metricCards[10];
static uint8_t metricCardCount = 0;

struct DistBarWidgets {
  lv_obj_t *bar;
  lv_obj_t *lblTitle;
  lv_obj_t *lblVal;
  uint32_t darkColor;
  uint32_t lightColor;
};
static DistBarWidgets distBars[5];
static uint8_t distBarCount = 0;

/* Stat labels on Overview Tab */
static lv_obj_t *lblValTelnet, *lblValSsh, *lblValFtp, *lblValHttp, *lblValPing;
static lv_obj_t *lblValTotal, *lblValIps, *lblValCreds, *lblValPayloads, *lblValScans;
static lv_obj_t *barTelnet, *barSsh, *barFtp, *barHttp, *barPing;
static lv_obj_t *lblBarTelnet, *lblBarSsh, *lblBarFtp, *lblBarHttp, *lblBarPing;
static lv_obj_t *lblRecentTickers[4];
static lv_obj_t *lblDistT;
static lv_obj_t *lblTickT;
static lv_obj_t *lblCrT;
static lv_obj_t *lblPlT;
static lv_obj_t *lblSysT;
static lv_obj_t *lblBatT;
static lv_obj_t *lblBlt;
static lv_obj_t *lblThemeSec;
static lv_obj_t *lblBatK1, *lblBatK2;
static lv_obj_t *lblBatDetails;
static lv_obj_t *lblDistNames[5];

/* Threat Log Tab */
static lv_obj_t *tableLog;
static lv_obj_t *btnFilterHot;
static bool filterAlertsOnly = false;

/* IP Table Tab */
static lv_obj_t *tableIps;

/* Loot Tab */
static lv_obj_t *tableCreds;
static lv_obj_t *tablePayloads;

/* Settings Tab */
static lv_obj_t *sliderBrightness;
static lv_obj_t *lblBrightnessVal;
static lv_obj_t *lblSdInfo;

/* Reusable styles */
static lv_style_t style_card_dark, style_card_light;
static lv_style_t style_hdr_dark, style_hdr_light;
static lv_style_t style_scr_dark, style_scr_light;

/* Theme Toggle Button Callback */
static void onThemeToggleClicked(lv_event_t *e) {
  isDarkMode = !isDarkMode;
  applyTheme(isDarkMode);
  saveState(true);
}

/* Brightness Slider Callback */
static void onBrightnessSliderChanged(lv_event_t *e) {
  lv_obj_t *slider = lv_event_get_target(e);
  int val = (int)lv_slider_get_value(slider);
  currentBrightness = (uint8_t)val;
  IO_EXTENSION_Pwm_Output(currentBrightness);
  if (lblBrightnessVal) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%d%%", currentBrightness);
    lv_label_set_text(lblBrightnessVal, buf);
  }
}

/* Log row click -> Detailed Popup Callback */
static void onLogTableClicked(lv_event_t *e) {
  lv_obj_t *table = lv_event_get_target(e);
  uint16_t row, col;
  lv_table_get_selected_cell(table, &row, &col);
  if (row >= logCount) return;

  // Find corresponding log entry
  int idx = logCount - 1 - row;
  if (idx < 0 || idx >= logCount) return;
  const LogEntry &entry = logEntries[idx];

  char msg[256];
  snprintf(msg, sizeof(msg), "Time: %s\nService: %s\nSource IP: %s\nMAC: %s\n\nDetail:\n%s",
           entry.time, entry.svc, entry.ip, (entry.mac[0] ? entry.mac : "--"), entry.detail);

  static const char *btns[] = {"Dismiss", ""};
  lv_obj_t *mbox = lv_msgbox_create(NULL, "Threat Inspection", msg, btns, true);
  lv_obj_center(mbox);
}

/* Clear state button callback */
static void onClearBtnClicked(lv_event_t *e) {
  if (sdOk) {
    SD_MMC.remove(LOG_PATH);
    SD_MMC.remove(STATE_PATH);
  }
  memset(&st, 0, sizeof(st));
  ipCount = 0;
  credCount = 0;
  payloadCount = 0;
  logCount = 0;
  updateDashboardMetrics();
  updateIpTableUI();
  updateLootUI();

  static const char *btns[] = {"OK", ""};
  lv_obj_t *mbox = lv_msgbox_create(NULL, "Reset Completed", "Log and state files have been cleared.", btns, true);
  lv_obj_center(mbox);
}

/* Wi-Fi Configuration & Virtual Keyboard Event Callbacks */
static void onWifiScanClicked(lv_event_t *e) {
  if (wifiIsScanning) return;
  xTaskCreate(wifiScanTask, "w_scan", 8192, NULL, 1, NULL);
}

static void onWifiDropdownChanged(lv_event_t *e) {
  lv_obj_t *dropdown = lv_event_get_target(e);
  char buf[64];
  lv_dropdown_get_selected_str(dropdown, buf, sizeof(buf));
  char *paren = strchr(buf, '(');
  if (paren && paren > buf) {
    *(paren - 1) = '\0';
  }
  int len = strlen(buf);
  while (len > 0 && (buf[len - 1] == ' ' || buf[len - 1] == '\t')) {
    buf[len - 1] = '\0';
    len--;
  }
  if (taWifiSsid && buf[0] != '-' && buf[0] != '\0') {
    lv_textarea_set_text(taWifiSsid, buf);
    strncpy(curWifiSsid, buf, sizeof(curWifiSsid) - 1);
    curWifiSsid[sizeof(curWifiSsid) - 1] = '\0';
    if (lblWifiStatus) {
      char sbuf[96];
      snprintf(sbuf, sizeof(sbuf), "Selected '%s'. Enter password & connect.", buf);
      lv_label_set_text(lblWifiStatus, sbuf);
      lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0x58A6FF), 0);
    }
  }
}

static void closeKbModal(bool apply) {
  if (!kbModal) return;
  if (apply && activeTargetTa && taKbInput) {
    const char *txt = lv_textarea_get_text(taKbInput);
    lv_textarea_set_text(activeTargetTa, txt ? txt : "");
    if (activeTargetTa == taWifiSsid) {
      strncpy(curWifiSsid, txt ? txt : "", sizeof(curWifiSsid) - 1);
      curWifiSsid[sizeof(curWifiSsid) - 1] = '\0';
    } else if (activeTargetTa == taWifiPass) {
      strncpy(curWifiPass, txt ? txt : "", sizeof(curWifiPass) - 1);
      curWifiPass[sizeof(curWifiPass) - 1] = '\0';
    }
  }
  lv_obj_add_flag(kbModal, LV_OBJ_FLAG_HIDDEN);
  activeTargetTa = nullptr;
}

static void onKbDoneClicked(lv_event_t *e) {
  closeKbModal(true);
}

