pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
static void onKbCancelClicked(lv_event_t *e) {
  closeKbModal(false);
}

static void onKbTogglePassClicked(lv_event_t *e) {
  if (!taKbInput) return;
  bool pwdMode = lv_textarea_get_password_mode(taKbInput);
  lv_textarea_set_password_mode(taKbInput, !pwdMode);
  if (lblKbShowPass) {
    lv_label_set_text(lblKbShowPass, !pwdMode ? "Hide" : "Show");
  }
}

static void onWifiInputFocused(lv_event_t *e) {
  lv_obj_t *ta = lv_event_get_target(e);
  if (!kbModal || !taKbInput) return;

  activeTargetTa = ta;
  const char *curr = lv_textarea_get_text(ta);
  lv_textarea_set_text(taKbInput, curr ? curr : "");

  if (ta == taWifiPass) {
    if (lblKbPrompt) lv_label_set_text(lblKbPrompt, "PASSWORD:");
    lv_textarea_set_password_mode(taKbInput, true);
    if (lblKbShowPass) lv_label_set_text(lblKbShowPass, "Show");
    if (btnKbShowPass) lv_obj_clear_flag(btnKbShowPass, LV_OBJ_FLAG_HIDDEN);
  } else {
    if (lblKbPrompt) lv_label_set_text(lblKbPrompt, "SSID:");
    lv_textarea_set_password_mode(taKbInput, false);
    if (btnKbShowPass) lv_obj_add_flag(btnKbShowPass, LV_OBJ_FLAG_HIDDEN);
  }

  lv_keyboard_set_textarea(kbWifi, taKbInput);
  lv_keyboard_set_mode(kbWifi, LV_KEYBOARD_MODE_TEXT_LOWER);
  lv_obj_clear_flag(kbModal, LV_OBJ_FLAG_HIDDEN);
  lv_obj_move_foreground(kbModal);
}

static void onWifiKeyboardAction(lv_event_t *e) {
  lv_event_code_t code = lv_event_get_code(e);
  if (code == LV_EVENT_READY) {
    closeKbModal(true);
  } else if (code == LV_EVENT_CANCEL) {
    closeKbModal(false);
  }
}

static void onWifiConnectClicked(lv_event_t *e) {
  if (wifiIsConnecting || wifiIsScanning) return;
  if (!taWifiSsid || !taWifiPass) return;
  const char *s = lv_textarea_get_text(taWifiSsid);
  const char *p = lv_textarea_get_text(taWifiPass);
  if (!s || !s[0]) {
    if (lblWifiStatus) {
      lv_label_set_text(lblWifiStatus, "Please select or type an SSID.");
      lv_obj_set_style_text_color(lblWifiStatus, lv_color_hex(0xF85149), 0);
    }
    return;
  }
  strncpy(wifiPendingSsid, s, sizeof(wifiPendingSsid) - 1);
  wifiPendingSsid[sizeof(wifiPendingSsid) - 1] = '\0';
  strncpy(wifiPendingPass, p ? p : "", sizeof(wifiPendingPass) - 1);
  wifiPendingPass[sizeof(wifiPendingPass) - 1] = '\0';
  if (kbModal) lv_obj_add_flag(kbModal, LV_OBJ_FLAG_HIDDEN);
  xTaskCreate(wifiConnectTask, "w_conn", 6144, NULL, 1, NULL);
}

static void onWifiShowPassClicked(lv_event_t *e) {
  if (!taWifiPass) return;
  bool pwdMode = lv_textarea_get_password_mode(taWifiPass);
  lv_textarea_set_password_mode(taWifiPass, !pwdMode);
  if (lblWifiShowPassBtn) {
    lv_label_set_text(lblWifiShowPassBtn, !pwdMode ? "Hide" : "Show");
  }
}

/* Helper to build a metric card */
static lv_obj_t* createMetricCard(lv_obj_t *parent, const char *title, uint32_t darkCol, uint32_t lightCol, lv_obj_t **outValLabel) {
  uint32_t col = isDarkMode ? darkCol : lightCol;
  lv_obj_t *card = lv_obj_create(parent);
  lv_obj_set_size(card, 185, 96);
  lv_obj_clear_flag(card, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_pad_all(card, 8, 0);
  lv_obj_set_style_radius(card, 8, 0);
  lv_obj_set_style_border_width(card, 2, 0);
  lv_obj_set_style_border_color(card, lv_color_hex(col), 0);
  lv_obj_set_style_bg_color(card, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);

  lv_obj_t *lblT = lv_label_create(card);
  lv_label_set_text(lblT, title);
  lv_obj_set_style_text_color(lblT, lv_color_hex(col), 0);
  lv_obj_set_style_text_font(lblT, &lv_font_montserrat_12, 0);
  lv_obj_align(lblT, LV_ALIGN_TOP_LEFT, 0, 0);

  lv_obj_t *lblV = lv_label_create(card);
  lv_label_set_text(lblV, "0");
  lv_obj_set_style_text_font(lblV, &lv_font_montserrat_28, 0);
  lv_obj_set_style_text_color(lblV, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblV, LV_ALIGN_BOTTOM_LEFT, 0, 0);

  if (metricCardCount < 10) {
    metricCards[metricCardCount++] = {card, lblT, lblV, darkCol, lightCol};
  }

  if (outValLabel) *outValLabel = lblV;
  return card;
}

/* Apply Dark vs Light Theme Styles */
void applyTheme(bool dark) {
  if (!esp_lv_adapter_lock(200)) return;

  lv_color_t c_bg   = dark ? lv_color_hex(0x0B0F14) : lv_color_hex(0xF0F2F5);
  lv_color_t c_hdr  = dark ? lv_color_hex(0x161B22) : lv_color_hex(0xE1E4E8);
  lv_color_t c_card = dark ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF);
  lv_color_t c_txt  = dark ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328);
  lv_color_t c_dim  = dark ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F);

  if (scr) lv_obj_set_style_bg_color(scr, c_bg, 0);
  if (hdr) lv_obj_set_style_bg_color(hdr, c_hdr, 0);

  if (lblTitle) lv_obj_set_style_text_color(lblTitle, dark ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  if (lblClock) lv_obj_set_style_text_color(lblClock, c_txt, 0);

  if (btnTheme && lblThemeBtn) {
    lv_label_set_text(lblThemeBtn, dark ? "☀️ LIGHT" : "🌙 DARK");
    lv_obj_set_style_bg_color(btnTheme, dark ? lv_color_hex(0x21262D) : lv_color_hex(0xD0D7DE), 0);
    lv_obj_set_style_text_color(lblThemeBtn, c_txt, 0);
    lv_obj_set_style_border_color(btnTheme, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  }

  if (btnThemeSettings && lblThemeSettingsBtn) {
    lv_label_set_text(lblThemeSettingsBtn, dark ? "Switch to Light UI" : "Switch to Dark UI");
    lv_obj_set_style_bg_color(btnThemeSettings, dark ? lv_color_hex(0x21262D) : lv_color_hex(0xD0D7DE), 0);
    lv_obj_set_style_text_color(lblThemeSettingsBtn, c_txt, 0);
    lv_obj_set_style_border_color(btnThemeSettings, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  }
  if (lblThemeModeInfo) {
    lv_label_set_text(lblThemeModeInfo, dark ? "Current Mode: DARK (Cyber SOC)" : "Current Mode: LIGHT (Daylight)");
    lv_obj_set_style_text_color(lblThemeModeInfo, c_txt, 0);
  }

  if (tabview) {
    lv_obj_set_style_bg_color(tabview, c_bg, 0);
    lv_obj_t *tab_btns = lv_tabview_get_tab_btns(tabview);
    if (tab_btns) {
      lv_obj_set_style_bg_color(tab_btns, c_hdr, 0);
      lv_obj_set_style_text_color(tab_btns, c_txt, 0);
    }
  }

  // Update registered container cards
  for (uint8_t i = 0; i < uiCardCount; i++) {
    if (uiCards[i]) {
      lv_obj_set_style_bg_color(uiCards[i], c_card, 0);
      lv_obj_set_style_border_color(uiCards[i], dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
    }
  }

  // Update Metric Cards (Card bg, border color, title color, value text color)
  for (uint8_t i = 0; i < metricCardCount; i++) {
    uint32_t col = dark ? metricCards[i].darkColor : metricCards[i].lightColor;
    lv_obj_set_style_bg_color(metricCards[i].card, c_card, 0);
    lv_obj_set_style_border_color(metricCards[i].card, lv_color_hex(col), 0);
    lv_obj_set_style_text_color(metricCards[i].lblTitle, lv_color_hex(col), 0);
    lv_obj_set_style_text_color(metricCards[i].lblVal, c_txt, 0);
  }

  // Update tables
  auto styleTable = [&](lv_obj_t *tbl) {
    if (!tbl) return;
    lv_obj_set_style_bg_color(tbl, c_card, LV_PART_MAIN);
    lv_obj_set_style_text_color(tbl, c_txt, LV_PART_MAIN);
    lv_obj_set_style_bg_color(tbl, c_card, LV_PART_ITEMS);
    lv_obj_set_style_text_color(tbl, c_txt, LV_PART_ITEMS);
    lv_obj_set_style_border_color(tbl, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), LV_PART_MAIN);
    lv_obj_set_style_border_color(tbl, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), LV_PART_ITEMS);
  };
  styleTable(tableLog);
  styleTable(tableIps);
  styleTable(tableCreds);
  styleTable(tablePayloads);

