pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // Update Service Distribution Bars, Borders, Indicators & Count Labels
  lv_color_t c_bar_bg = dark ? lv_color_hex(0x21262D) : lv_color_hex(0xEAEEF2);
  lv_color_t c_bar_border = dark ? lv_color_hex(0x8B949E) : lv_color_hex(0x57606A);
  for (uint8_t i = 0; i < distBarCount; i++) {
    uint32_t col = dark ? distBars[i].darkColor : distBars[i].lightColor;
    lv_obj_set_style_bg_color(distBars[i].bar, c_bar_bg, 0);
    lv_obj_set_style_border_color(distBars[i].bar, c_bar_border, 0);
    lv_obj_set_style_border_width(distBars[i].bar, 2, 0);
    lv_obj_set_style_pad_all(distBars[i].bar, 1, 0);
    lv_obj_set_style_bg_color(distBars[i].bar, lv_color_hex(col), LV_PART_INDICATOR);
    lv_obj_set_style_text_color(distBars[i].lblTitle, lv_color_hex(col), 0);
    lv_obj_set_style_text_color(distBars[i].lblVal, c_txt, 0);
  }

  if (barBattery) {
    lv_obj_set_style_bg_color(barBattery, c_bar_bg, 0);
    lv_obj_set_style_border_color(barBattery, c_bar_border, 0);
    lv_obj_set_style_border_width(barBattery, 2, 0);
    lv_obj_set_style_pad_all(barBattery, 1, 0);
  }

  // Section titles
  if (lblDistT) lv_obj_set_style_text_color(lblDistT, dark ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  if (lblTickT) lv_obj_set_style_text_color(lblTickT, dark ? lv_color_hex(0xF85149) : lv_color_hex(0xA40E26), 0);
  if (lblCrT)   lv_obj_set_style_text_color(lblCrT,   dark ? lv_color_hex(0xF85149) : lv_color_hex(0xA40E26), 0);
  if (lblPlT)   lv_obj_set_style_text_color(lblPlT,   dark ? lv_color_hex(0xF85149) : lv_color_hex(0xA40E26), 0);
  if (lblSysT)  lv_obj_set_style_text_color(lblSysT,  dark ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  if (lblBatT)  lv_obj_set_style_text_color(lblBatT,  dark ? lv_color_hex(0x3FB950) : lv_color_hex(0x0F5323), 0);

  // System & Settings labels
  if (lblBlt)           lv_obj_set_style_text_color(lblBlt, c_txt, 0);
  if (lblBrightnessVal) lv_obj_set_style_text_color(lblBrightnessVal, c_txt, 0);
  if (lblThemeSec)      lv_obj_set_style_text_color(lblThemeSec, c_txt, 0);
  if (lblSdInfo)        lv_obj_set_style_text_color(lblSdInfo, c_dim, 0);

  // Telemetry and Battery labels
  if (lblBatPctVal)     lv_obj_set_style_text_color(lblBatPctVal, c_txt, 0);
  if (lblBatVoltageVal) lv_obj_set_style_text_color(lblBatVoltageVal, c_txt, 0);
  if (lblBatAdcVal)     lv_obj_set_style_text_color(lblBatAdcVal, c_txt, 0);
  if (lblBatK1)         lv_obj_set_style_text_color(lblBatK1, c_dim, 0);
  if (lblBatK2)         lv_obj_set_style_text_color(lblBatK2, c_dim, 0);
  if (lblBatDetails)    lv_obj_set_style_text_color(lblBatDetails, c_dim, 0);

  if (lblWifiPill)      lv_obj_set_style_text_color(lblWifiPill, c_dim, 0);
  if (lblHeapPill)      lv_obj_set_style_text_color(lblHeapPill, c_dim, 0);

  // Wi-Fi Controls styling
  if (lblWifiTitle)     lv_obj_set_style_text_color(lblWifiTitle, dark ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  if (lblWifiCur)       lv_obj_set_style_text_color(lblWifiCur, c_dim, 0);
  if (lblWifiStatus)    lv_obj_set_style_text_color(lblWifiStatus, c_dim, 0);
  if (taWifiSsid) {
    lv_obj_set_style_bg_color(taWifiSsid, dark ? lv_color_hex(0x0D1117) : lv_color_hex(0xEAEEF2), 0);
    lv_obj_set_style_text_color(taWifiSsid, c_txt, 0);
    lv_obj_set_style_border_color(taWifiSsid, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  }
  if (taWifiPass) {
    lv_obj_set_style_bg_color(taWifiPass, dark ? lv_color_hex(0x0D1117) : lv_color_hex(0xEAEEF2), 0);
    lv_obj_set_style_text_color(taWifiPass, c_txt, 0);
    lv_obj_set_style_border_color(taWifiPass, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  }
  if (btnWifiScan && lblWifiScanBtn) {
    lv_obj_set_style_bg_color(btnWifiScan, dark ? lv_color_hex(0x21262D) : lv_color_hex(0xD0D7DE), 0);
    lv_obj_set_style_text_color(lblWifiScanBtn, c_txt, 0);
  }
  if (btnWifiShowPass && lblWifiShowPassBtn) {
    lv_obj_set_style_bg_color(btnWifiShowPass, dark ? lv_color_hex(0x21262D) : lv_color_hex(0xD0D7DE), 0);
    lv_obj_set_style_text_color(lblWifiShowPassBtn, c_txt, 0);
  }
  if (ddWifiSsid) {
    lv_obj_set_style_bg_color(ddWifiSsid, dark ? lv_color_hex(0x0D1117) : lv_color_hex(0xEAEEF2), 0);
    lv_obj_set_style_text_color(ddWifiSsid, c_txt, 0);
    lv_obj_set_style_border_color(ddWifiSsid, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
    lv_obj_t *ddList = lv_dropdown_get_list(ddWifiSsid);
    if (ddList) {
      lv_obj_set_style_bg_color(ddList, dark ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
      lv_obj_set_style_text_color(ddList, c_txt, 0);
      lv_obj_set_style_border_color(ddList, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
    }
  }

  // Keyboard Modal & Typing Preview Bar styling
  if (kbModal) {
    lv_obj_set_style_bg_color(kbModal, dark ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
    lv_obj_set_style_border_color(kbModal, dark ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  }
  if (taKbInput) {
    lv_obj_set_style_bg_color(taKbInput, dark ? lv_color_hex(0x0D1117) : lv_color_hex(0xEAEEF2), 0);
    lv_obj_set_style_text_color(taKbInput, c_txt, 0);
    lv_obj_set_style_border_color(taKbInput, dark ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  }
  if (lblKbPrompt) {
    lv_obj_set_style_text_color(lblKbPrompt, dark ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  }
  if (btnKbShowPass && lblKbShowPass) {
    lv_obj_set_style_bg_color(btnKbShowPass, dark ? lv_color_hex(0x21262D) : lv_color_hex(0xD0D7DE), 0);
    lv_obj_set_style_text_color(lblKbShowPass, c_txt, 0);
  }

  for (int i = 0; i < 4; i++) {
    if (lblRecentTickers[i]) {
      const char *t = lv_label_get_text(lblRecentTickers[i]);
      if (t && strstr(t, "Awaiting inbound probes")) {
        lv_obj_set_style_text_color(lblRecentTickers[i], c_dim, 0);
      }
    }
  }

  esp_lv_adapter_unlock();
}

/*=================== BOOT SPLASH SCREEN =======================*/
static lv_obj_t *splashCont = nullptr;
static lv_obj_t *splashSpinner = nullptr;

void showSplash() {
  if (!esp_lv_adapter_lock(-1)) return;

  // Use a full-screen container over the default active screen (never delete active screen)
  splashCont = lv_obj_create(lv_scr_act());
  lv_obj_set_size(splashCont, 1024, 600);
  lv_obj_align(splashCont, LV_ALIGN_TOP_LEFT, 0, 0);
  lv_obj_clear_flag(splashCont, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_bg_color(splashCont, lv_color_hex(0x090E14), 0);
  lv_obj_set_style_bg_opa(splashCont, LV_OPA_COVER, 0);
  lv_obj_set_style_border_width(splashCont, 0, 0);
  lv_obj_set_style_radius(splashCont, 0, 0);
  lv_obj_set_style_pad_all(splashCont, 0, 0);

  // ── Emblem badge ──
  lv_obj_t *badge = lv_obj_create(splashCont);
  lv_obj_set_size(badge, 68, 68);
  lv_obj_align(badge, LV_ALIGN_CENTER, 0, -70);
  lv_obj_set_style_radius(badge, 34, 0);
  lv_obj_set_style_bg_color(badge, lv_color_hex(0x101D2D), 0);
  lv_obj_set_style_border_color(badge, lv_color_hex(0x58D9F9), 0);
  lv_obj_set_style_border_width(badge, 2, 0);
  lv_obj_clear_flag(badge, LV_OBJ_FLAG_SCROLLABLE);

  lv_obj_t *lblIcon = lv_label_create(badge);
  lv_label_set_text(lblIcon, LV_SYMBOL_BELL);
  lv_obj_set_style_text_font(lblIcon, &lv_font_montserrat_28, 0);
  lv_obj_set_style_text_color(lblIcon, lv_color_hex(0x58D9F9), 0);
  lv_obj_center(lblIcon);

  // ── VERA wordmark ──
  lv_obj_t *lblVera = lv_label_create(splashCont);
  lv_label_set_text(lblVera, "V E R A");
  lv_obj_set_style_text_font(lblVera, &lv_font_montserrat_28, 0);
  lv_obj_set_style_text_color(lblVera, lv_color_hex(0x58D9F9), 0);
  lv_obj_align(lblVera, LV_ALIGN_CENTER, 0, -10);

