pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // ── Subtitle ──
  lv_obj_t *lblSub = lv_label_create(splashCont);
  lv_label_set_text(lblSub, "CYBER DEFENSE NODE");
  lv_obj_set_style_text_font(lblSub, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblSub, lv_color_hex(0x4D6478), 0);
  lv_obj_align(lblSub, LV_ALIGN_CENTER, 0, 22);

  // ── Circular Load Bar (Animated Spinner) ──
  splashSpinner = lv_spinner_create(splashCont, 1000, 60);
  lv_obj_set_size(splashSpinner, 46, 46);
  lv_obj_align(splashSpinner, LV_ALIGN_CENTER, 0, 70);
  lv_obj_set_style_arc_width(splashSpinner, 4, LV_PART_MAIN);
  lv_obj_set_style_arc_color(splashSpinner, lv_color_hex(0x162235), LV_PART_MAIN);
  lv_obj_set_style_arc_width(splashSpinner, 4, LV_PART_INDICATOR);
  lv_obj_set_style_arc_color(splashSpinner, lv_color_hex(0x58D9F9), LV_PART_INDICATOR);

  // ── Status label below circular load bar ──
  lv_obj_t *lblLoad = lv_label_create(splashCont);
  lv_label_set_text(lblLoad, "INITIALIZING SYSTEM...");
  lv_obj_set_style_text_font(lblLoad, &lv_font_montserrat_10, 0);
  lv_obj_set_style_text_color(lblLoad, lv_color_hex(0x388BFD), 0);
  lv_obj_align(lblLoad, LV_ALIGN_CENTER, 0, 108);

  // ── Version label (bottom right) ──
  lv_obj_t *lblVer = lv_label_create(splashCont);
  lv_label_set_text(lblVer, "v2.0  Waveshare ESP32-S3-Touch-LCD-7B");
  lv_obj_set_style_text_font(lblVer, &lv_font_montserrat_10, 0);
  lv_obj_set_style_text_color(lblVer, lv_color_hex(0x283A4A), 0);
  lv_obj_align(lblVer, LV_ALIGN_BOTTOM_RIGHT, -14, -10);

  esp_lv_adapter_unlock();

  // Enable backlight at 15% so splash is visible during hardware init
  IO_EXTENSION_Pwm_Output(15);
  wavesahre_rgb_lcd_bl_on();

  // Hold splash for 2.0 s (LVGL timer keeps running so circular load bar rotates)
  delay(2000);

  // Turn backlight off before building real UI to avoid white flash
  IO_EXTENSION_Pwm_Output(0);

  // Tear down splash container cleanly
  if (esp_lv_adapter_lock(-1)) {
    if (splashCont) {
      lv_obj_del(splashCont);
      splashCont = nullptr;
      splashSpinner = nullptr;
    }
    esp_lv_adapter_unlock();
  }
}

/* Create the Complete 1024x600 GUI */
void createUI() {
  if (!esp_lv_adapter_lock(-1)) return;

  uiCardCount = 0;
  metricCardCount = 0;
  scr = lv_scr_act();
  lv_obj_clear_flag(scr, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_bg_color(scr, lv_color_hex(0x0B0F14), 0);

  /* ---- 1. HEADER BAR (1024 x 46) ---- */
  hdr = lv_obj_create(scr);
  lv_obj_set_size(hdr, 1024, 46);
  lv_obj_align(hdr, LV_ALIGN_TOP_MID, 0, 0);
  lv_obj_clear_flag(hdr, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_radius(hdr, 0, 0);
  lv_obj_set_style_border_width(hdr, 0, 0);
  lv_obj_set_style_pad_hor(hdr, 14, 0);
  lv_obj_set_style_pad_ver(hdr, 6, 0);
  lv_obj_set_style_bg_color(hdr, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xE1E4E8), 0);

  // Title (Left: X = 0)
  lblTitle = lv_label_create(hdr);
  lv_label_set_text(lblTitle, "VERA");
  lv_obj_set_style_text_font(lblTitle, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(lblTitle, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  lv_obj_align(lblTitle, LV_ALIGN_LEFT_MID, 0, 0);

  // Clock (Left: X = 65)
  lblClock = lv_label_create(hdr);
  lv_label_set_text(lblClock, "00:00:00");
  lv_obj_set_style_text_font(lblClock, &lv_font_montserrat_14, 0);
  lv_obj_set_style_text_color(lblClock, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblClock, LV_ALIGN_LEFT_MID, 65, 0);

  // Theme Toggle Button (Left: X = 160)
  btnTheme = lv_btn_create(hdr);
  lv_obj_set_size(btnTheme, 88, 30);
  lv_obj_align(btnTheme, LV_ALIGN_LEFT_MID, 160, 0);
  lv_obj_set_style_radius(btnTheme, 6, 0);
  lv_obj_set_style_border_width(btnTheme, 1, 0);
  lv_obj_set_style_border_color(btnTheme, isDarkMode ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  lv_obj_set_style_bg_color(btnTheme, isDarkMode ? lv_color_hex(0x21262D) : lv_color_hex(0xD0D7DE), 0);
  lv_obj_add_event_cb(btnTheme, onThemeToggleClicked, LV_EVENT_CLICKED, NULL);

  lblThemeBtn = lv_label_create(btnTheme);
  lv_label_set_text(lblThemeBtn, isDarkMode ? "☀️ LIGHT" : "🌙 DARK");
  lv_obj_set_style_text_font(lblThemeBtn, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblThemeBtn, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_center(lblThemeBtn);

  // Battery Pill (Left: X = 265)
  lblBatteryPill = lv_label_create(hdr);
  lv_label_set_text(lblBatteryPill, "⚡ BAT --");
  lv_obj_set_style_text_font(lblBatteryPill, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblBatteryPill, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  lv_obj_align(lblBatteryPill, LV_ALIGN_LEFT_MID, 265, 0);

  // SD Badge (Left: X = 435)
  lblSdBadge = lv_label_create(hdr);
  lv_label_set_text(lblSdBadge, "NO SD");
  lv_obj_set_style_text_font(lblSdBadge, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblSdBadge, isDarkMode ? lv_color_hex(0xF85149) : lv_color_hex(0xCF222E), 0);
  lv_obj_align(lblSdBadge, LV_ALIGN_LEFT_MID, 435, 0);

  // WiFi Pill (Right: offset -80)
  lblWifiPill = lv_label_create(hdr);
  lv_label_set_text(lblWifiPill, "Connecting...");
  lv_obj_set_style_text_font(lblWifiPill, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblWifiPill, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
  lv_obj_align(lblWifiPill, LV_ALIGN_RIGHT_MID, -80, 0);

  // Free Heap (Right: offset 0)
  lblHeapPill = lv_label_create(hdr);
  lv_label_set_text(lblHeapPill, "--k free");
  lv_obj_set_style_text_font(lblHeapPill, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblHeapPill, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
  lv_obj_align(lblHeapPill, LV_ALIGN_RIGHT_MID, 0, 0);

  /* ---- 2. TABVIEW (1024 x 554) ---- */
  tabview = lv_tabview_create(scr, LV_DIR_TOP, 42);
  lv_obj_set_size(tabview, 1024, 554);
  lv_obj_align(tabview, LV_ALIGN_BOTTOM_MID, 0, 0);
  lv_obj_set_style_bg_color(tabview, isDarkMode ? lv_color_hex(0x0B0F14) : lv_color_hex(0xF0F2F5), 0);

  lv_obj_t *tab_btns = lv_tabview_get_tab_btns(tabview);
  if (tab_btns) {
    lv_obj_set_style_bg_color(tab_btns, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xE1E4E8), 0);
    lv_obj_set_style_text_color(tab_btns, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  }

