pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  lv_obj_t *tOverview = lv_tabview_add_tab(tabview, "OVERVIEW");
  lv_obj_t *tLogs     = lv_tabview_add_tab(tabview, "THREAT LOG");
  lv_obj_t *tIps      = lv_tabview_add_tab(tabview, "ATTACKERS");
  lv_obj_t *tLoot     = lv_tabview_add_tab(tabview, "CAPTURED LOOT");
  lv_obj_t *tSettings = lv_tabview_add_tab(tabview, "SYSTEM");

  /* ========================================================
     TAB 1: OVERVIEW (SOC DASHBOARD)
     ======================================================== */
  lv_obj_set_style_pad_all(tOverview, 10, 0);

  // Row 1: Protocol Stat Cards
  lv_obj_t *row1 = lv_obj_create(tOverview);
  lv_obj_set_size(row1, 996, 110);
  lv_obj_align(row1, LV_ALIGN_TOP_MID, 0, 0);
  lv_obj_set_flex_flow(row1, LV_FLEX_FLOW_ROW);
  lv_obj_set_flex_align(row1, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
  lv_obj_set_style_bg_opa(row1, LV_OPA_TRANSP, 0);
  lv_obj_set_style_border_width(row1, 0, 0);
  lv_obj_set_style_pad_all(row1, 0, 0);

  metricCardCount = 0;
  createMetricCard(row1, "TELNET (PORT 23)", 0x3FB950, 0x0F5323, &lblValTelnet);
  createMetricCard(row1, "SSH (PORT 22)",    0x39C5CF, 0x0550AE, &lblValSsh);
  createMetricCard(row1, "FTP (PORT 21)",    0xD29922, 0x8C5303, &lblValFtp);
  createMetricCard(row1, "HTTP (PORT 80)",   0xF0883E, 0xA40E26, &lblValHttp);
  createMetricCard(row1, "PING (ICMP)",      0xDB61A2, 0x5C2B97, &lblValPing);

  // Row 2: Secondary Threat Metric Cards
  lv_obj_t *row2 = lv_obj_create(tOverview);
  lv_obj_set_size(row2, 996, 110);
  lv_obj_align(row2, LV_ALIGN_TOP_MID, 0, 118);
  lv_obj_set_flex_flow(row2, LV_FLEX_FLOW_ROW);
  lv_obj_set_flex_align(row2, LV_FLEX_ALIGN_SPACE_BETWEEN, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
  lv_obj_set_style_bg_opa(row2, LV_OPA_TRANSP, 0);
  lv_obj_set_style_border_width(row2, 0, 0);
  lv_obj_set_style_pad_all(row2, 0, 0);

  createMetricCard(row2, "TOTAL PROBES",   0x58A6FF, 0x0550AE, &lblValTotal);
  createMetricCard(row2, "UNIQUE HOSTS",   0x7EE787, 0x0F5323, &lblValIps);
  createMetricCard(row2, "CREDS HARVEST",  0xF85149, 0xA40E26, &lblValCreds);
  createMetricCard(row2, "SHELL PAYLOADS", 0xF85149, 0xA40E26, &lblValPayloads);
  createMetricCard(row2, "PORT SCANNERS",  0xBC8CFF, 0x5C2B97, &lblValScans);

  // Row 3: Service Distribution & Live Activity Ticker
  lv_obj_t *cardDist = lv_obj_create(tOverview);
  lv_obj_set_size(cardDist, 488, 230);
  lv_obj_align(cardDist, LV_ALIGN_BOTTOM_LEFT, 0, 0);
  lv_obj_set_style_radius(cardDist, 8, 0);
  lv_obj_set_style_pad_all(cardDist, 10, 0);
  lv_obj_set_style_bg_color(cardDist, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  lv_obj_set_style_border_color(cardDist, isDarkMode ? lv_color_hex(0x30363D) : lv_color_hex(0x8C959F), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = cardDist;

  lblDistT = lv_label_create(cardDist);
  lv_label_set_text(lblDistT, "SERVICE ATTACK DISTRIBUTION");
  lv_obj_set_style_text_font(lblDistT, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblDistT, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);

  // Distribution Bars
  distBarCount = 0;
  auto makeBar = [&](const char *name, uint32_t darkCol, uint32_t lightCol, int y, lv_obj_t **b, lv_obj_t **l) {
    uint32_t col = isDarkMode ? darkCol : lightCol;
    lv_obj_t *t = lv_label_create(cardDist);
    lv_label_set_text(t, name);
    lv_obj_set_style_text_font(t, &lv_font_montserrat_10, 0);
    lv_obj_set_style_text_color(t, lv_color_hex(col), 0);
    lv_obj_align(t, LV_ALIGN_TOP_LEFT, 0, y);

    *b = lv_bar_create(cardDist);
    lv_obj_set_size(*b, 340, 14);
    lv_obj_align(*b, LV_ALIGN_TOP_LEFT, 64, y);
    lv_obj_set_style_radius(*b, 4, 0);
    lv_obj_set_style_radius(*b, 3, LV_PART_INDICATOR);
    lv_obj_set_style_border_width(*b, 2, 0);
    lv_obj_set_style_border_color(*b, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x57606A), 0);
    lv_obj_set_style_pad_all(*b, 1, 0);
    lv_obj_set_style_bg_color(*b, isDarkMode ? lv_color_hex(0x21262D) : lv_color_hex(0xEAEEF2), 0);
    lv_obj_set_style_bg_color(*b, lv_color_hex(col), LV_PART_INDICATOR);
    lv_bar_set_range(*b, 0, 100);

    *l = lv_label_create(cardDist);
    lv_label_set_text(*l, "0");
    lv_obj_set_style_text_font(*l, &lv_font_montserrat_10, 0);
    lv_obj_set_style_text_color(*l, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
    lv_obj_align(*l, LV_ALIGN_TOP_RIGHT, 0, y);

    if (distBarCount < 5) {
      distBars[distBarCount++] = {*b, t, *l, darkCol, lightCol};
    }
  };

  makeBar("TELNET", 0x3FB950, 0x0F5323, 30,  &barTelnet, &lblBarTelnet);
  makeBar("SSH",    0x39C5CF, 0x0550AE, 65,  &barSsh,    &lblBarSsh);
  makeBar("FTP",    0xD29922, 0x8C5303, 100, &barFtp,    &lblBarFtp);
  makeBar("HTTP",   0xF0883E, 0xA40E26, 135, &barHttp,   &lblBarHttp);
  makeBar("PING",   0xDB61A2, 0x5C2B97, 170, &barPing,   &lblBarPing);

  // Live Activity Ticker Box
  lv_obj_t *cardTicker = lv_obj_create(tOverview);
  lv_obj_set_size(cardTicker, 488, 230);
  lv_obj_align(cardTicker, LV_ALIGN_BOTTOM_RIGHT, 0, 0);
  lv_obj_set_style_radius(cardTicker, 8, 0);
  lv_obj_set_style_pad_all(cardTicker, 10, 0);
  lv_obj_set_style_bg_color(cardTicker, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  lv_obj_set_style_border_color(cardTicker, isDarkMode ? lv_color_hex(0x30363D) : lv_color_hex(0xD0D7DE), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = cardTicker;

  lblTickT = lv_label_create(cardTicker);
  lv_label_set_text(lblTickT, "LATEST THREAT FEED");
  lv_obj_set_style_text_font(lblTickT, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblTickT, isDarkMode ? lv_color_hex(0xF85149) : lv_color_hex(0xCF222E), 0);

  for (int i = 0; i < 4; i++) {
    lblRecentTickers[i] = lv_label_create(cardTicker);
    lv_label_set_text(lblRecentTickers[i], "[--:--:--] System Armed. Awaiting inbound probes...");
    lv_obj_set_style_text_font(lblRecentTickers[i], &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(lblRecentTickers[i], lv_color_hex(0x8B949E), 0);
    lv_obj_align(lblRecentTickers[i], LV_ALIGN_TOP_LEFT, 0, 30 + i * 44);
  }

  /* ========================================================
     TAB 2: THREAT LOG (INTERACTIVE CONSOLE)
     ======================================================== */
  lv_obj_set_style_pad_all(tLogs, 8, 0);

  tableLog = lv_table_create(tLogs);
  lv_obj_set_size(tableLog, 996, 450);
  lv_obj_align(tableLog, LV_ALIGN_TOP_MID, 0, 0);
  lv_table_set_col_width(tableLog, 0, 95);  // Time
  lv_table_set_col_width(tableLog, 1, 85);  // Service
  lv_table_set_col_width(tableLog, 2, 280); // Source IP & MAC
  lv_table_set_col_width(tableLog, 3, 520); // Detail
  lv_table_set_cell_value(tableLog, 0, 0, "TIME");
  lv_table_set_cell_value(tableLog, 0, 1, "SERVICE");
  lv_table_set_cell_value(tableLog, 0, 2, "SOURCE IP & MAC");
  lv_table_set_cell_value(tableLog, 0, 3, "EVENT DETAIL");
  lv_obj_add_event_cb(tableLog, onLogTableClicked, LV_EVENT_VALUE_CHANGED, NULL);

  /* ========================================================
     TAB 3: ATTACKING HOSTS
     ======================================================== */
  lv_obj_set_style_pad_all(tIps, 8, 0);

  tableIps = lv_table_create(tIps);
  lv_obj_set_size(tableIps, 996, 450);
  lv_obj_align(tableIps, LV_ALIGN_TOP_MID, 0, 0);
  lv_table_set_col_width(tableIps, 0, 200); // IP
  lv_table_set_col_width(tableIps, 1, 210); // MAC Address
  lv_table_set_col_width(tableIps, 2, 330); // Services touched
  lv_table_set_col_width(tableIps, 3, 230); // Threat Level
  lv_table_set_cell_value(tableIps, 0, 0, "ATTACKER IP");
  lv_table_set_cell_value(tableIps, 0, 1, "MAC ADDRESS");
  lv_table_set_cell_value(tableIps, 0, 2, "TOUCHED SERVICES");
  lv_table_set_cell_value(tableIps, 0, 3, "THREAT LEVEL");

  /* ========================================================
     TAB 4: CAPTURED LOOT
     ======================================================== */
  lv_obj_set_style_pad_all(tLoot, 8, 0);

  lv_obj_t *boxCreds = lv_obj_create(tLoot);
  lv_obj_set_size(boxCreds, 488, 450);
  lv_obj_align(boxCreds, LV_ALIGN_LEFT_MID, 0, 0);
  lv_obj_set_style_pad_all(boxCreds, 6, 0);
  lv_obj_set_style_bg_color(boxCreds, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  lv_obj_set_style_border_color(boxCreds, isDarkMode ? lv_color_hex(0x30363D) : lv_color_hex(0xD0D7DE), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = boxCreds;

  lblCrT = lv_label_create(boxCreds);
  lv_label_set_text(lblCrT, "CAPTURED CREDENTIALS");
  lv_obj_set_style_text_font(lblCrT, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblCrT, isDarkMode ? lv_color_hex(0xF85149) : lv_color_hex(0xA40E26), 0);

  tableCreds = lv_table_create(boxCreds);
  lv_obj_set_size(tableCreds, 470, 390);
  lv_obj_align(tableCreds, LV_ALIGN_TOP_MID, 0, 24);
  lv_table_set_col_width(tableCreds, 0, 70);  // Svc
  lv_table_set_col_width(tableCreds, 1, 120); // IP
  lv_table_set_col_width(tableCreds, 2, 130); // User
  lv_table_set_col_width(tableCreds, 3, 130); // Password
  lv_table_set_cell_value(tableCreds, 0, 0, "SVC");
  lv_table_set_cell_value(tableCreds, 0, 1, "SOURCE");
  lv_table_set_cell_value(tableCreds, 0, 2, "USERNAME");
  lv_table_set_cell_value(tableCreds, 0, 3, "PASSWORD");

  lv_obj_t *boxPayloads = lv_obj_create(tLoot);
  lv_obj_set_size(boxPayloads, 488, 450);
  lv_obj_align(boxPayloads, LV_ALIGN_RIGHT_MID, 0, 0);
  lv_obj_set_style_pad_all(boxPayloads, 6, 0);
  lv_obj_set_style_bg_color(boxPayloads, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  lv_obj_set_style_border_color(boxPayloads, isDarkMode ? lv_color_hex(0x30363D) : lv_color_hex(0xD0D7DE), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = boxPayloads;

