pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  lblPlT = lv_label_create(boxPayloads);
  lv_label_set_text(lblPlT, "EXPLOIT COMMANDS & PAYLOAD URLS");
  lv_obj_set_style_text_font(lblPlT, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblPlT, isDarkMode ? lv_color_hex(0xF85149) : lv_color_hex(0xA40E26), 0);

  tablePayloads = lv_table_create(boxPayloads);
  lv_obj_set_size(tablePayloads, 470, 390);
  lv_obj_align(tablePayloads, LV_ALIGN_TOP_MID, 0, 24);
  lv_table_set_col_width(tablePayloads, 0, 70);  // Svc
  lv_table_set_col_width(tablePayloads, 1, 120); // IP
  lv_table_set_col_width(tablePayloads, 2, 260); // Command
  lv_table_set_cell_value(tablePayloads, 0, 0, "SVC");
  lv_table_set_cell_value(tablePayloads, 0, 1, "SOURCE");
  lv_table_set_cell_value(tablePayloads, 0, 2, "PAYLOAD COMMAND");

  /* ========================================================
     TAB 5: SYSTEM & HARDWARE CONTROL
     ======================================================== */
  lv_obj_set_style_pad_all(tSettings, 10, 0);

  // Left Card: Display, Theme & Node Controls (485 x 475)
  lv_obj_t *cardSys = lv_obj_create(tSettings);
  lv_obj_set_size(cardSys, 488, 475);
  lv_obj_align(cardSys, LV_ALIGN_TOP_LEFT, 0, 0);
  lv_obj_set_style_radius(cardSys, 8, 0);
  lv_obj_set_style_pad_all(cardSys, 12, 0);
  lv_obj_set_style_border_width(cardSys, 2, 0);
  lv_obj_set_style_border_color(cardSys, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  lv_obj_set_style_bg_color(cardSys, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = cardSys;

  lblSysT = lv_label_create(cardSys);
  lv_label_set_text(lblSysT, "DISPLAY & SYSTEM CONTROLS");
  lv_obj_set_style_text_font(lblSysT, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblSysT, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  lv_obj_align(lblSysT, LV_ALIGN_TOP_LEFT, 0, 0);

  // Backlight Slider
  lblBlt = lv_label_create(cardSys);
  lv_label_set_text(lblBlt, "LCD Backlight (PWM via CH32V003):");
  lv_obj_set_style_text_font(lblBlt, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblBlt, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblBlt, LV_ALIGN_TOP_LEFT, 0, 24);

  sliderBrightness = lv_slider_create(cardSys);
  lv_obj_set_size(sliderBrightness, 360, 18);
  lv_obj_align(sliderBrightness, LV_ALIGN_TOP_LEFT, 0, 48);
  lv_slider_set_range(sliderBrightness, 10, 100);
  lv_slider_set_value(sliderBrightness, currentBrightness, LV_ANIM_OFF);
  lv_obj_add_event_cb(sliderBrightness, onBrightnessSliderChanged, LV_EVENT_VALUE_CHANGED, NULL);

  lblBrightnessVal = lv_label_create(cardSys);
  char bBuf[16];
  snprintf(bBuf, sizeof(bBuf), "%d%%", currentBrightness);
  lv_label_set_text(lblBrightnessVal, bBuf);
  lv_obj_set_style_text_font(lblBrightnessVal, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblBrightnessVal, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblBrightnessVal, LV_ALIGN_TOP_LEFT, 380, 48);

  // Theme Settings Section
  lblThemeSec = lv_label_create(cardSys);
  lv_label_set_text(lblThemeSec, "UI Mode Theme Selection:");
  lv_obj_set_style_text_font(lblThemeSec, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblThemeSec, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblThemeSec, LV_ALIGN_TOP_LEFT, 0, 84);

  lblThemeModeInfo = lv_label_create(cardSys);
  lv_label_set_text(lblThemeModeInfo, isDarkMode ? "Current Mode: DARK (Cyber SOC)" : "Current Mode: LIGHT (Daylight)");
  lv_obj_set_style_text_font(lblThemeModeInfo, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblThemeModeInfo, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblThemeModeInfo, LV_ALIGN_TOP_LEFT, 0, 106);

  btnThemeSettings = lv_btn_create(cardSys);
  lv_obj_set_size(btnThemeSettings, 220, 34);
  lv_obj_align(btnThemeSettings, LV_ALIGN_TOP_LEFT, 0, 132);
  lv_obj_set_style_radius(btnThemeSettings, 6, 0);
  lv_obj_add_event_cb(btnThemeSettings, onThemeToggleClicked, LV_EVENT_CLICKED, NULL);

  lblThemeSettingsBtn = lv_label_create(btnThemeSettings);
  lv_label_set_text(lblThemeSettingsBtn, isDarkMode ? "Switch to Light UI" : "Switch to Dark UI");
  lv_obj_set_style_text_font(lblThemeSettingsBtn, &lv_font_montserrat_12, 0);
  lv_obj_center(lblThemeSettingsBtn);

  // Storage and Node info
  lblSdInfo = lv_label_create(cardSys);
  lv_label_set_text(lblSdInfo, "STORAGE: MicroSD (SDMMC 1-bit mode)\n"
                               "PINS: CLK=12, CMD=11, D0=13\n"
                               "LOGS: /vera.log | STATE: /state.bin\n\n"
                               "WEB ADMIN URL: http://<ip>:8080/?key=" ADMIN_KEY);
  lv_obj_set_style_text_font(lblSdInfo, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblSdInfo, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
  lv_obj_align(lblSdInfo, LV_ALIGN_TOP_LEFT, 0, 186);

  // Clear data button
  lv_obj_t *btnClear = lv_btn_create(cardSys);
  lv_obj_set_size(btnClear, 220, 38);
  lv_obj_align(btnClear, LV_ALIGN_BOTTOM_LEFT, 0, 0);
  lv_obj_set_style_bg_color(btnClear, lv_color_hex(0xDA3633), 0);
  lv_obj_add_event_cb(btnClear, onClearBtnClicked, LV_EVENT_CLICKED, NULL);

  lv_obj_t *lblClr = lv_label_create(btnClear);
  lv_label_set_text(lblClr, "Wipe Logs & Reset State");
  lv_obj_set_style_text_font(lblClr, &lv_font_montserrat_12, 0);
  lv_obj_center(lblClr);

  // Right Top Card: Power & Battery Subsystem (488 x 205)
  lv_obj_t *cardBat = lv_obj_create(tSettings);
  lv_obj_set_size(cardBat, 488, 205);
  lv_obj_align(cardBat, LV_ALIGN_TOP_RIGHT, 0, 0);
  lv_obj_set_style_radius(cardBat, 8, 0);
  lv_obj_set_style_pad_all(cardBat, 10, 0);
  lv_obj_set_style_border_width(cardBat, 2, 0);
  lv_obj_set_style_border_color(cardBat, isDarkMode ? lv_color_hex(0x3FB950) : lv_color_hex(0x0F5323), 0);
  lv_obj_set_style_bg_color(cardBat, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = cardBat;

  lblBatT = lv_label_create(cardBat);
  lv_label_set_text(lblBatT, "POWER & BATTERY SUBSYSTEM (CS8501)");
  lv_obj_set_style_text_font(lblBatT, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblBatT, isDarkMode ? lv_color_hex(0x3FB950) : lv_color_hex(0x0F5323), 0);
  lv_obj_align(lblBatT, LV_ALIGN_TOP_LEFT, 0, 0);

  // Battery Level Bar
  barBattery = lv_bar_create(cardBat);
  lv_obj_set_size(barBattery, 450, 18);
  lv_obj_align(barBattery, LV_ALIGN_TOP_LEFT, 0, 22);
  lv_obj_set_style_radius(barBattery, 4, 0);
  lv_obj_set_style_radius(barBattery, 3, LV_PART_INDICATOR);
  lv_obj_set_style_border_width(barBattery, 2, 0);
  lv_obj_set_style_border_color(barBattery, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x57606A), 0);
  lv_obj_set_style_pad_all(barBattery, 1, 0);
  lv_obj_set_style_bg_color(barBattery, isDarkMode ? lv_color_hex(0x21262D) : lv_color_hex(0xEAEEF2), 0);
  lv_obj_set_style_bg_color(barBattery, isDarkMode ? lv_color_hex(0x3FB950) : lv_color_hex(0x0F5323), LV_PART_INDICATOR);
  lv_bar_set_range(barBattery, 0, 100);
  lv_bar_set_value(barBattery, 0, LV_ANIM_OFF);

  // Large Battery readout
  lblBatPctVal = lv_label_create(cardBat);
  lv_label_set_text(lblBatPctVal, "--%");
  lv_obj_set_style_text_font(lblBatPctVal, &lv_font_montserrat_28, 0);
  lv_obj_set_style_text_color(lblBatPctVal, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblBatPctVal, LV_ALIGN_TOP_LEFT, 0, 44);

  lblBatStatusVal = lv_label_create(cardBat);
  lv_label_set_text(lblBatStatusVal, "Reading battery telemetry...");
  lv_obj_set_style_text_font(lblBatStatusVal, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblBatStatusVal, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  lv_obj_align(lblBatStatusVal, LV_ALIGN_TOP_LEFT, 0, 76);

