pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // Metrics Table / Key-Value list
  auto makeBatRow = [&](const char *label, const char *initVal, int y, lv_obj_t **outVal, lv_obj_t **outKey) {
    lv_obj_t *lblK = lv_label_create(cardBat);
    lv_label_set_text(lblK, label);
    lv_obj_set_style_text_font(lblK, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(lblK, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
    lv_obj_align(lblK, LV_ALIGN_TOP_LEFT, 0, y);
    if (outKey) *outKey = lblK;

    lv_obj_t *lblV = lv_label_create(cardBat);
    lv_label_set_text(lblV, initVal);
    lv_obj_set_style_text_font(lblV, &lv_font_montserrat_12, 0);
    lv_obj_set_style_text_color(lblV, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
    lv_obj_align(lblV, LV_ALIGN_TOP_LEFT, 150, y);
    if (outVal) *outVal = lblV;
  };

  makeBatRow("Battery Voltage:", "-- V", 100, &lblBatVoltageVal, &lblBatK1);
  makeBatRow("Expander ADC Raw:", "-- / 1023", 122, &lblBatAdcVal, &lblBatK2);

  lblBatDetails = lv_label_create(cardBat);
  lv_label_set_text(lblBatDetails,
    "CS8501 580mA · Single-Cell 3.7V Li-ion (PH2.0) · CH32V003 3:1 ADC"
  );
  lv_obj_set_style_text_font(lblBatDetails, &lv_font_montserrat_10, 0);
  lv_obj_set_style_text_color(lblBatDetails, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
  lv_obj_align(lblBatDetails, LV_ALIGN_TOP_LEFT, 0, 150);

  // Right Bottom Card: Wi-Fi Configuration (488 x 255)
  cardWifi = lv_obj_create(tSettings);
  lv_obj_set_size(cardWifi, 488, 255);
  lv_obj_align(cardWifi, LV_ALIGN_TOP_RIGHT, 0, 220);
  lv_obj_set_style_radius(cardWifi, 8, 0);
  lv_obj_set_style_pad_all(cardWifi, 10, 0);
  lv_obj_set_style_border_width(cardWifi, 2, 0);
  lv_obj_set_style_border_color(cardWifi, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  lv_obj_set_style_bg_color(cardWifi, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  if (uiCardCount < 24) uiCards[uiCardCount++] = cardWifi;

  lblWifiTitle = lv_label_create(cardWifi);
  lv_label_set_text(lblWifiTitle, "WI-FI CONFIGURATION & CONNECT");
  lv_obj_set_style_text_font(lblWifiTitle, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblWifiTitle, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0550AE), 0);
  lv_obj_align(lblWifiTitle, LV_ALIGN_TOP_LEFT, 0, 0);

  lblWifiCur = lv_label_create(cardWifi);
  lv_label_set_text(lblWifiCur, "Status: Connecting...");
  lv_obj_set_style_text_font(lblWifiCur, &lv_font_montserrat_10, 0);
  lv_obj_set_style_text_color(lblWifiCur, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
  lv_obj_align(lblWifiCur, LV_ALIGN_TOP_LEFT, 0, 20);

  // SSID Label & Textarea & Scan Button
  lv_obj_t *lblSsidTag = lv_label_create(cardWifi);
  lv_label_set_text(lblSsidTag, "SSID:");
  lv_obj_set_style_text_font(lblSsidTag, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblSsidTag, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblSsidTag, LV_ALIGN_TOP_LEFT, 0, 48);

  taWifiSsid = lv_textarea_create(cardWifi);
  lv_obj_set_size(taWifiSsid, 270, 32);
  lv_obj_align(taWifiSsid, LV_ALIGN_TOP_LEFT, 65, 42);
  lv_textarea_set_one_line(taWifiSsid, true);
  lv_textarea_set_placeholder_text(taWifiSsid, "Network SSID");
  lv_textarea_set_text(taWifiSsid, curWifiSsid);
  lv_obj_add_event_cb(taWifiSsid, onWifiInputFocused, LV_EVENT_FOCUSED, NULL);
  lv_obj_add_event_cb(taWifiSsid, onWifiInputFocused, LV_EVENT_CLICKED, NULL);

  btnWifiScan = lv_btn_create(cardWifi);
  lv_obj_set_size(btnWifiScan, 110, 32);
  lv_obj_align(btnWifiScan, LV_ALIGN_TOP_LEFT, 345, 42);
  lv_obj_set_style_radius(btnWifiScan, 6, 0);
  lv_obj_add_event_cb(btnWifiScan, onWifiScanClicked, LV_EVENT_CLICKED, NULL);

  lblWifiScanBtn = lv_label_create(btnWifiScan);
  lv_label_set_text(lblWifiScanBtn, "🔍 Scan APs");
  lv_obj_set_style_text_font(lblWifiScanBtn, &lv_font_montserrat_10, 0);
  lv_obj_center(lblWifiScanBtn);

  // APs Dropdown
  lv_obj_t *lblApTag = lv_label_create(cardWifi);
  lv_label_set_text(lblApTag, "APs:");
  lv_obj_set_style_text_font(lblApTag, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblApTag, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblApTag, LV_ALIGN_TOP_LEFT, 0, 86);

  ddWifiSsid = lv_dropdown_create(cardWifi);
  lv_obj_set_size(ddWifiSsid, 390, 32);
  lv_obj_align(ddWifiSsid, LV_ALIGN_TOP_LEFT, 65, 80);
  lv_dropdown_set_options(ddWifiSsid, "-- Tap 'Scan APs' to discover networks --");
  lv_obj_add_event_cb(ddWifiSsid, onWifiDropdownChanged, LV_EVENT_VALUE_CHANGED, NULL);

  // Password Label & Textarea & Show button
  lv_obj_t *lblPassTag = lv_label_create(cardWifi);
  lv_label_set_text(lblPassTag, "Pass:");
  lv_obj_set_style_text_font(lblPassTag, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblPassTag, isDarkMode ? lv_color_hex(0xF0F6FC) : lv_color_hex(0x1F2328), 0);
  lv_obj_align(lblPassTag, LV_ALIGN_TOP_LEFT, 0, 124);

  taWifiPass = lv_textarea_create(cardWifi);
  lv_obj_set_size(taWifiPass, 310, 32);
  lv_obj_align(taWifiPass, LV_ALIGN_TOP_LEFT, 65, 118);
  lv_textarea_set_one_line(taWifiPass, true);
  lv_textarea_set_password_mode(taWifiPass, true);
  lv_textarea_set_placeholder_text(taWifiPass, "Password");
  lv_textarea_set_text(taWifiPass, curWifiPass);
  lv_obj_add_event_cb(taWifiPass, onWifiInputFocused, LV_EVENT_FOCUSED, NULL);
  lv_obj_add_event_cb(taWifiPass, onWifiInputFocused, LV_EVENT_CLICKED, NULL);

  btnWifiShowPass = lv_btn_create(cardWifi);
  lv_obj_set_size(btnWifiShowPass, 70, 32);
  lv_obj_align(btnWifiShowPass, LV_ALIGN_TOP_LEFT, 385, 118);
  lv_obj_set_style_radius(btnWifiShowPass, 6, 0);
  lv_obj_add_event_cb(btnWifiShowPass, onWifiShowPassClicked, LV_EVENT_CLICKED, NULL);

  lblWifiShowPassBtn = lv_label_create(btnWifiShowPass);
  lv_label_set_text(lblWifiShowPassBtn, "Show");
  lv_obj_set_style_text_font(lblWifiShowPassBtn, &lv_font_montserrat_10, 0);
  lv_obj_center(lblWifiShowPassBtn);

  // Connect Button
  btnWifiConnect = lv_btn_create(cardWifi);
  lv_obj_set_size(btnWifiConnect, 160, 34);
  lv_obj_align(btnWifiConnect, LV_ALIGN_TOP_LEFT, 65, 156);
  lv_obj_set_style_radius(btnWifiConnect, 6, 0);
  lv_obj_set_style_bg_color(btnWifiConnect, lv_color_hex(0x238636), 0);
  lv_obj_add_event_cb(btnWifiConnect, onWifiConnectClicked, LV_EVENT_CLICKED, NULL);

  lblWifiConnBtn = lv_label_create(btnWifiConnect);
  lv_label_set_text(lblWifiConnBtn, "Connect Wi-Fi");
  lv_obj_set_style_text_font(lblWifiConnBtn, &lv_font_montserrat_12, 0);
  lv_obj_center(lblWifiConnBtn);

  // Status Message
  lblWifiStatus = lv_label_create(cardWifi);
  lv_label_set_text(lblWifiStatus, "Ready. Select network and enter password.");
  lv_obj_set_style_text_font(lblWifiStatus, &lv_font_montserrat_10, 0);
  lv_obj_set_style_text_color(lblWifiStatus, isDarkMode ? lv_color_hex(0x8B949E) : lv_color_hex(0x24292F), 0);
  lv_obj_align(lblWifiStatus, LV_ALIGN_TOP_LEFT, 0, 202);

  /* ---- 5. ON-SCREEN KEYBOARD MODAL & PREVIEW DIALOG ---- */
  kbModal = lv_obj_create(scr);
  lv_obj_set_size(kbModal, 1010, 288);
  lv_obj_align(kbModal, LV_ALIGN_BOTTOM_MID, 0, -4);
  lv_obj_clear_flag(kbModal, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_radius(kbModal, 8, 0);
  lv_obj_set_style_pad_all(kbModal, 6, 0);
  lv_obj_set_style_border_width(kbModal, 2, 0);
  lv_obj_set_style_border_color(kbModal, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  lv_obj_set_style_bg_color(kbModal, isDarkMode ? lv_color_hex(0x161B22) : lv_color_hex(0xFFFFFF), 0);
  lv_obj_add_flag(kbModal, LV_OBJ_FLAG_HIDDEN);

