pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // Top Live Typing / Preview Header Bar
  lblKbPrompt = lv_label_create(kbModal);
  lv_label_set_text(lblKbPrompt, "INPUT:");
  lv_obj_set_style_text_font(lblKbPrompt, &lv_font_montserrat_12, 0);
  lv_obj_set_style_text_color(lblKbPrompt, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
  lv_obj_align(lblKbPrompt, LV_ALIGN_TOP_LEFT, 6, 10);

  taKbInput = lv_textarea_create(kbModal);
  lv_obj_set_size(taKbInput, 610, 36);
  lv_obj_align(taKbInput, LV_ALIGN_TOP_LEFT, 85, 2);
  lv_textarea_set_one_line(taKbInput, true);
  lv_obj_set_style_text_font(taKbInput, &lv_font_montserrat_14, 0);
  lv_obj_set_style_radius(taKbInput, 6, 0);

  btnKbShowPass = lv_btn_create(kbModal);
  lv_obj_set_size(btnKbShowPass, 75, 36);
  lv_obj_align(btnKbShowPass, LV_ALIGN_TOP_LEFT, 705, 2);
  lv_obj_set_style_radius(btnKbShowPass, 6, 0);
  lv_obj_add_event_cb(btnKbShowPass, onKbTogglePassClicked, LV_EVENT_CLICKED, NULL);

  lblKbShowPass = lv_label_create(btnKbShowPass);
  lv_label_set_text(lblKbShowPass, "Show");
  lv_obj_set_style_text_font(lblKbShowPass, &lv_font_montserrat_12, 0);
  lv_obj_center(lblKbShowPass);

  btnKbDone = lv_btn_create(kbModal);
  lv_obj_set_size(btnKbDone, 100, 36);
  lv_obj_align(btnKbDone, LV_ALIGN_TOP_LEFT, 790, 2);
  lv_obj_set_style_radius(btnKbDone, 6, 0);
  lv_obj_set_style_bg_color(btnKbDone, lv_color_hex(0x238636), 0);
  lv_obj_add_event_cb(btnKbDone, onKbDoneClicked, LV_EVENT_CLICKED, NULL);

  lv_obj_t *lblKbDone = lv_label_create(btnKbDone);
  lv_label_set_text(lblKbDone, "✔ Done");
  lv_obj_set_style_text_font(lblKbDone, &lv_font_montserrat_12, 0);
  lv_obj_center(lblKbDone);

  btnKbCancel = lv_btn_create(kbModal);
  lv_obj_set_size(btnKbCancel, 90, 36);
  lv_obj_align(btnKbCancel, LV_ALIGN_TOP_LEFT, 900, 2);
  lv_obj_set_style_radius(btnKbCancel, 6, 0);
  lv_obj_set_style_bg_color(btnKbCancel, lv_color_hex(0xDA3633), 0);
  lv_obj_add_event_cb(btnKbCancel, onKbCancelClicked, LV_EVENT_CLICKED, NULL);

  lv_obj_t *lblKbCancel = lv_label_create(btnKbCancel);
  lv_label_set_text(lblKbCancel, "✖ Close");
  lv_obj_set_style_text_font(lblKbCancel, &lv_font_montserrat_12, 0);
  lv_obj_center(lblKbCancel);

  // Capacitive Keyboard attached directly to the preview textarea
  kbWifi = lv_keyboard_create(kbModal);
  lv_obj_set_size(kbWifi, 994, 232);
  lv_obj_align(kbWifi, LV_ALIGN_BOTTOM_MID, 0, 0);
  lv_keyboard_set_textarea(kbWifi, taKbInput);
  lv_obj_add_event_cb(kbWifi, onWifiKeyboardAction, LV_EVENT_ALL, NULL);

  // Apply complete theme while mutex is still held to prevent any unstyled white flash
  applyTheme(isDarkMode);

  esp_lv_adapter_unlock();
}

/* Update dashboard numbers and progress bars */
void updateDashboardMetrics() {
  if (!esp_lv_adapter_lock(100)) return;

  char buf[16];
  snprintf(buf, sizeof(buf), "%u", st.telnet);   if (lblValTelnet) lv_label_set_text(lblValTelnet, buf);
  snprintf(buf, sizeof(buf), "%u", st.ssh);      if (lblValSsh)    lv_label_set_text(lblValSsh, buf);
  snprintf(buf, sizeof(buf), "%u", st.ftp);      if (lblValFtp)    lv_label_set_text(lblValFtp, buf);
  snprintf(buf, sizeof(buf), "%u", st.http);     if (lblValHttp)   lv_label_set_text(lblValHttp, buf);
  snprintf(buf, sizeof(buf), "%u", st.ping);     if (lblValPing)   lv_label_set_text(lblValPing, buf);

  snprintf(buf, sizeof(buf), "%u", st.total);    if (lblValTotal)  lv_label_set_text(lblValTotal, buf);
  snprintf(buf, sizeof(buf), "%u", ipCount);     if (lblValIps)    lv_label_set_text(lblValIps, buf);
  snprintf(buf, sizeof(buf), "%u", st.creds);    if (lblValCreds)  lv_label_set_text(lblValCreds, buf);
  snprintf(buf, sizeof(buf), "%u", st.payloads); if (lblValPayloads) lv_label_set_text(lblValPayloads, buf);
  snprintf(buf, sizeof(buf), "%u", st.scans);    if (lblValScans)  lv_label_set_text(lblValScans, buf);

  uint32_t mx = max((uint32_t)1, max(st.telnet, max(st.ssh, max(st.ftp, max(st.http, st.ping)))));
  if (barTelnet) lv_bar_set_value(barTelnet, (st.telnet * 100) / mx, LV_ANIM_OFF);
  if (barSsh)    lv_bar_set_value(barSsh,    (st.ssh * 100) / mx, LV_ANIM_OFF);
  if (barFtp)    lv_bar_set_value(barFtp,    (st.ftp * 100) / mx, LV_ANIM_OFF);
  if (barHttp)   lv_bar_set_value(barHttp,   (st.http * 100) / mx, LV_ANIM_OFF);
  if (barPing)   lv_bar_set_value(barPing,   (st.ping * 100) / mx, LV_ANIM_OFF);

  if (lblBarTelnet) { snprintf(buf, sizeof(buf), "%u", st.telnet); lv_label_set_text(lblBarTelnet, buf); }
  if (lblBarSsh)    { snprintf(buf, sizeof(buf), "%u", st.ssh);    lv_label_set_text(lblBarSsh, buf); }
  if (lblBarFtp)    { snprintf(buf, sizeof(buf), "%u", st.ftp);    lv_label_set_text(lblBarFtp, buf); }
  if (lblBarHttp)   { snprintf(buf, sizeof(buf), "%u", st.http);   lv_label_set_text(lblBarHttp, buf); }
  if (lblBarPing)   { snprintf(buf, sizeof(buf), "%u", st.ping);   lv_label_set_text(lblBarPing, buf); }

  esp_lv_adapter_unlock();
}

/* Add a live event to the on-screen table and ticker */
void addEventToUI(const LogEntry &e) {
  if (!esp_lv_adapter_lock(100)) return;

  // Update Ticker
  for (int i = 3; i > 0; i--) {
    if (lblRecentTickers[i] && lblRecentTickers[i - 1]) {
      lv_label_set_text(lblRecentTickers[i], lv_label_get_text(lblRecentTickers[i - 1]));
    }
  }
  if (lblRecentTickers[0]) {
    char tickBuf[128];
    if (e.mac[0] && strcmp(e.mac, "--") != 0) {
      snprintf(tickBuf, sizeof(tickBuf), "[%s] %-6s %s [%s] %s", e.time, e.svc, e.ip, e.mac, e.detail);
    } else {
      snprintf(tickBuf, sizeof(tickBuf), "[%s] %-6s %-15s %s", e.time, e.svc, e.ip, e.detail);
    }
    lv_label_set_text(lblRecentTickers[0], tickBuf);
    uint32_t c = e.color;
    if (!isDarkMode) {
      if (c == 0x3FB950) c = 0x0F5323; // Deep dark green
      else if (c == 0x39C5CF) c = 0x0550AE; // Deep dark blue
      else if (c == 0xD29922) c = 0x8C5303; // Deep dark bronze
      else if (c == 0xF0883E) c = 0xA40E26; // Deep dark orange/crimson
      else if (c == 0xDB61A2) c = 0x5C2B97; // Deep dark purple
      else if (c == 0xF85149) c = 0xA40E26; // Deep dark red
      else c = 0x1F2328; // Pitch charcoal
    }
    lv_obj_set_style_text_color(lblRecentTickers[0], lv_color_hex(c), 0);
  }

