pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // Update Table (Insert at row 1)
  if (tableLog) {
    uint16_t row_cnt = lv_table_get_row_cnt(tableLog);
    if (row_cnt < 30) {
      lv_table_set_row_cnt(tableLog, row_cnt + 1);
    }
    // Shift rows down
    for (int r = min((int)row_cnt, 29); r >= 2; r--) {
      for (int c = 0; c < 4; c++) {
        lv_table_set_cell_value(tableLog, r, c, lv_table_get_cell_value(tableLog, r - 1, c));
      }
    }
    // Set newest row
    lv_table_set_cell_value(tableLog, 1, 0, e.time);
    lv_table_set_cell_value(tableLog, 1, 1, e.svc);
    char ip_mac_buf[40];
    if (e.mac[0] && strcmp(e.mac, "--") != 0) {
      snprintf(ip_mac_buf, sizeof(ip_mac_buf), "%s [%s]", e.ip, e.mac);
    } else {
      snprintf(ip_mac_buf, sizeof(ip_mac_buf), "%s", e.ip);
    }
    lv_table_set_cell_value(tableLog, 1, 2, ip_mac_buf);
    lv_table_set_cell_value(tableLog, 1, 3, e.detail);
  }

  esp_lv_adapter_unlock();
}

/* Update IP list tab */
void updateIpTableUI() {
  if (!tableIps) return;
  if (!esp_lv_adapter_lock(100)) return;

  uint16_t rows = min((int)ipCount, 40);
  lv_table_set_row_cnt(tableIps, rows + 1);

  for (uint8_t i = 0; i < rows; i++) {
    IPAddress ip(ipTab[i].ip);
    lv_table_set_cell_value(tableIps, i + 1, 0, ip.toString().c_str());
    lv_table_set_cell_value(tableIps, i + 1, 1, ipTab[i].mac[0] ? ipTab[i].mac : "--");

    String svcs;
    if (ipTab[i].mask & 1)  svcs += "TELNET ";
    if (ipTab[i].mask & 2)  svcs += "SSH ";
    if (ipTab[i].mask & 4)  svcs += "FTP ";
    if (ipTab[i].mask & 8)  svcs += "HTTP ";
    if (ipTab[i].mask & 16) svcs += "PING ";
    lv_table_set_cell_value(tableIps, i + 1, 2, svcs.c_str());

    lv_table_set_cell_value(tableIps, i + 1, 3, ipTab[i].flagged ? "PORT SCANNER (FLAGGED)" : "PROBING");
  }

  esp_lv_adapter_unlock();
}

/* Update Loot tab */
void updateLootUI() {
  if (!esp_lv_adapter_lock(100)) return;

  if (tableCreds) {
    uint16_t r = min((int)credCount, 25);
    lv_table_set_row_cnt(tableCreds, r + 1);
    for (int i = 0; i < r; i++) {
      int idx = credCount - 1 - i;
      lv_table_set_cell_value(tableCreds, i + 1, 0, credTab[idx].svc);
      lv_table_set_cell_value(tableCreds, i + 1, 1, credTab[idx].ip);
      lv_table_set_cell_value(tableCreds, i + 1, 2, credTab[idx].user);
      lv_table_set_cell_value(tableCreds, i + 1, 3, credTab[idx].pass);
    }
  }

  if (tablePayloads) {
    uint16_t r = min((int)payloadCount, 25);
    lv_table_set_row_cnt(tablePayloads, r + 1);
    for (int i = 0; i < r; i++) {
      int idx = payloadCount - 1 - i;
      lv_table_set_cell_value(tablePayloads, i + 1, 0, payloadTab[idx].svc);
      lv_table_set_cell_value(tablePayloads, i + 1, 1, payloadTab[idx].ip);
      lv_table_set_cell_value(tablePayloads, i + 1, 2, payloadTab[idx].cmd);
    }
  }

  esp_lv_adapter_unlock();
}

/* Update top status bar badges, battery telemetry, and clock */
void updateStatusBarUI() {
  // Read latest battery telemetry from CH32V003 ADC
  updateBatteryTelemetry();

  if (!esp_lv_adapter_lock(100)) return;

  char ts[16];
  timeStr(ts, sizeof(ts), false);
  if (lblClock) lv_label_set_text(lblClock, ts);

  // Update Header Battery Pill
  if (lblBatteryPill) {
    lv_label_set_text(lblBatteryPill, curBat.pillText);
    if (isDarkMode) {
      if (!curBat.present) {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0x58A6FF), 0); // USB blue/cyan
      } else if (curBat.charging) {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0x3FB950), 0); // Green charging
      } else if (curBat.percent <= 15) {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0xF85149), 0); // Red low
      } else {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0x7EE787), 0); // Bright green
      }
    } else {
      // High contrast colors for Light Mode on light header
      if (!curBat.present) {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0x0969DA), 0); // Deep sapphire blue
      } else if (curBat.charging) {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0x1A7F37), 0); // Deep forest green
      } else if (curBat.percent <= 15) {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0xCF222E), 0); // Deep crimson red
      } else {
        lv_obj_set_style_text_color(lblBatteryPill, lv_color_hex(0x1A7F37), 0); // Deep forest green
      }
    }
  }

  // Update System Tab Battery Subsystem Card
  if (barBattery) {
    lv_bar_set_value(barBattery, curBat.percent, LV_ANIM_ON);
    if (curBat.charging) {
      lv_obj_set_style_bg_color(barBattery, isDarkMode ? lv_color_hex(0x3FB950) : lv_color_hex(0x1A7F37), LV_PART_INDICATOR);
    } else if (curBat.percent <= 15) {
      lv_obj_set_style_bg_color(barBattery, isDarkMode ? lv_color_hex(0xF85149) : lv_color_hex(0xCF222E), LV_PART_INDICATOR);
    } else {
      lv_obj_set_style_bg_color(barBattery, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), LV_PART_INDICATOR);
    }
  }

  if (lblBatPctVal) {
    char pbuf[32];
    if (curBat.present) {
      snprintf(pbuf, sizeof(pbuf), "%d%%", curBat.percent);
    } else {
      snprintf(pbuf, sizeof(pbuf), "USB 5.0V");
    }
    lv_label_set_text(lblBatPctVal, pbuf);
  }

  if (lblBatStatusVal) {
    lv_label_set_text(lblBatStatusVal, curBat.status);
    if (curBat.charging) {
      lv_obj_set_style_text_color(lblBatStatusVal, isDarkMode ? lv_color_hex(0x3FB950) : lv_color_hex(0x1A7F37), 0);
    } else if (curBat.percent <= 15 && curBat.present) {
      lv_obj_set_style_text_color(lblBatStatusVal, isDarkMode ? lv_color_hex(0xF85149) : lv_color_hex(0xCF222E), 0);
    } else {
      lv_obj_set_style_text_color(lblBatStatusVal, isDarkMode ? lv_color_hex(0x58A6FF) : lv_color_hex(0x0969DA), 0);
    }
  }

  if (lblBatVoltageVal) {
    char vbuf[32];
    snprintf(vbuf, sizeof(vbuf), "%.2f V", curBat.voltage);
    lv_label_set_text(lblBatVoltageVal, vbuf);
  }

  if (lblBatAdcVal) {
    char abuf[32];
    snprintf(abuf, sizeof(abuf), "%u / 1023", curBat.rawAdc);
    lv_label_set_text(lblBatAdcVal, abuf);
  }

  if (lblSdBadge) {
    lv_label_set_text(lblSdBadge, sdOk ? "microSD OK" : "NO SD CARD");
    if (isDarkMode) {
      lv_obj_set_style_text_color(lblSdBadge, sdOk ? lv_color_hex(0x3FB950) : lv_color_hex(0xF85149), 0);
    } else {
      lv_obj_set_style_text_color(lblSdBadge, sdOk ? lv_color_hex(0x1A7F37) : lv_color_hex(0xCF222E), 0);
    }
  }

  if (lblWifiPill) {
    char wbuf[48];
    if (WiFi.status() == WL_CONNECTED) {
      snprintf(wbuf, sizeof(wbuf), "%s (%ddBm)", WiFi.localIP().toString().c_str(), WiFi.RSSI());
    } else {
      snprintf(wbuf, sizeof(wbuf), "WiFi Disconnected");
    }
    lv_label_set_text(lblWifiPill, wbuf);
  }

