pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  if (lblWifiCur && !wifiIsConnecting) {
    char cbuf[96];
    if (WiFi.status() == WL_CONNECTED) {
      snprintf(cbuf, sizeof(cbuf), "Connected: %s | %s (%ddBm)",
               WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
    } else {
      snprintf(cbuf, sizeof(cbuf), "Status: Disconnected / Offline");
    }
    lv_label_set_text(lblWifiCur, cbuf);
  }

  if (lblHeapPill) {
    char hbuf[32];
    snprintf(hbuf, sizeof(hbuf), "%uk free", ESP.getFreeHeap() / 1024);
    lv_label_set_text(lblHeapPill, hbuf);
  }

  esp_lv_adapter_unlock();
}


/*=================== 15. SETUP / LOOP ==========================*/
void setup() {
  // Prevent WiFi stack from writing to NVS SPI Flash (which disables CPU cache and crashes RGB LCD)
  WiFi.persistent(false);

  Serial.begin(115200);
  printf("\n[VERA] Bootloader handed over to setup()...\n");
  fflush(stdout);

  // Allow time for native USB CDC to enumerate so startup logs are captured
  unsigned long _waitStart = millis();
  while (!Serial && (millis() - _waitStart < 2000)) {
    delay(10);
  }
  delay(100);

  Serial.println("\n========================================================");
  Serial.println("  VERA // Waveshare ESP32-S3-Touch-LCD-7B");
  Serial.println("========================================================");
  Serial.printf("[SYSTEM] Chip: %s | Rev: %d | Cores: %d\n", ESP.getChipModel(), ESP.getChipRevision(), ESP.getChipCores());
  Serial.printf("[SYSTEM] Flash: %u MB | PSRAM: %u MB\n", ESP.getFlashChipSize() / (1024 * 1024), ESP.getPsramSize() / (1024 * 1024));
  Serial.printf("[SYSTEM] Free Heap: %u KB | Free PSRAM: %u KB\n", ESP.getFreeHeap() / 1024, ESP.getFreePsram() / 1024);

  // Check for Octal PSRAM (Required for 1024x600 RGB parallel double-buffer)
  if (!psramFound() || ESP.getPsramSize() < (2 * 1024 * 1024)) {
    Serial.println("\n********************************************************");
    Serial.println("  [CRITICAL ERROR] PSRAM IS NOT ENABLED!");
    Serial.println("  The 7.0\" 1024x600 RGB display requires 8MB Octal PSRAM.");
    Serial.println("  In Arduino IDE, open the Tools menu and configure:");
    Serial.println("    -> Tools > PSRAM: 'OPI PSRAM'");
    Serial.println("    -> Tools > Flash Size: '16MB (128Mb)'");
    Serial.println("    -> Tools > Partition Scheme: '16M Flash (3MB APP/9.9MB FATFS)'");
    Serial.println("********************************************************\n");
    Serial.println("[HALT] System paused to prevent boot loop. Please reflash with OPI PSRAM enabled.");
    while (true) {
      delay(2000);
      Serial.println("[HALT] Awaiting reflash with: Tools > PSRAM > 'OPI PSRAM'");
    }
  }

#if ALERT_PIN >= 0
  pinMode(ALERT_PIN, OUTPUT);
  digitalWrite(ALERT_PIN, LOW);
#endif

  memset(&st, 0, sizeof(st));
  memset(ipTab, 0, sizeof(ipTab));

  tn.active = false; tn.stage = 0; tn.tries = 0; tn.last = 0;
  ft.active = false; ft.stage = 0; ft.tries = 0; ft.last = 0;

  // 1. Mount the MicroSD Card via SDMMC (runs before LCD to avoid cache-disable conflicts)
  Serial.println("[INIT] Mounting MicroSD Card via SDMMC...");
  sdOk = mountSD();
  bool restored = false;
  if (sdOk) {
    restored = loadState();
    st.boots++;
    Serial.printf("[STATE] %s | Boot #%u | %u prior hits\n",
                  restored ? "Restored from card" : "Fresh state initialized",
                  st.boots, st.total);
  } else {
    st.boots++;
    Serial.println("[WARN] Running without persistent MicroSD storage");
  }

  // 2. Connect to Wi-Fi (completed before starting RGB LCD DMA)
  loadWifiConfig();
  Serial.printf("[WIFI] Connecting to %s...\n", curWifiSsid);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(false);
  WiFi.mode(WIFI_STA);
  esp_wifi_set_storage(WIFI_STORAGE_RAM);
  WiFi.setHostname(FAKE_HOST);
  WiFi.setSleep(false);
  WiFi.begin(curWifiSsid, curWifiPass);

  uint32_t t0 = millis();
  while (WiFi.status() != WL_CONNECTED && (millis() - t0) < 4000) {
    delay(200);
    Serial.print('.');
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WIFI] Connected! Local IP: %s\n", WiFi.localIP().toString().c_str());
    configTime(GMT_OFFSET_SEC, DST_OFFSET_SEC, "pool.ntp.org", "time.nist.gov");
    ntpConfigured = true;
  } else {
    Serial.println("\n[WIFI] Connection pending. Operating offline.");
  }

  // 3. Initialize hardware: GT911 Touch, RGB LCD Panel, and Backlight
  Serial.println("[INIT] Initializing capacitive touch (GT911)...");
  esp_lcd_touch_handle_t tp_handle = touch_gt911_init();
  if (tp_handle) {
    Serial.println("[INIT] GT911 touch initialized successfully.");
  } else {
    Serial.println("[WARN] GT911 touch not detected or init skipped; continuing.");
  }

  Serial.println("[INIT] Initializing 1024x600 RGB LCD panel...");
  esp_lcd_panel_handle_t panel_handle = waveshare_esp32_s3_rgb_lcd_init();
  if (!panel_handle) {
    Serial.println("\n********************************************************");
    Serial.println("  [CRITICAL ERROR] RGB LCD panel allocation failed!");
    Serial.println("  Make sure PSRAM is set to 'OPI PSRAM' in Arduino IDE.");
    Serial.println("********************************************************\n");
    while (true) {
      delay(2000);
      Serial.println("[HALT] Display driver halted to prevent boot loop.");
    }
  }
  Serial.println("[INIT] RGB LCD panel initialized.");

  // Keep backlight OFF during LVGL setup to eliminate boot lines and white flashes
  IO_EXTENSION_Init();
  IO_EXTENSION_Pwm_Output(0);
  wavesahre_rgb_lcd_bl_off();

  // 4. Initialize LVGL port adapter on Core 1
  Serial.println("[INIT] Initializing LVGL display and input drivers...");
  esp_err_t lv_err = esp_lv_adapter_init(panel_handle, tp_handle);
  if (lv_err != ESP_OK) {
    Serial.printf("[ERROR] esp_lv_adapter_init failed: 0x%x\n", lv_err);
    while (true) {
      delay(2000);
      Serial.println("[HALT] LVGL init failed.");
    }
  }
  Serial.println("[INIT] LVGL port initialized.");

  // 5. Show boot splash then build the real GUI
  showSplash();
  createUI();
  applyTheme(isDarkMode);

  if (restored) {
    applyTheme(isDarkMode);
    IO_EXTENSION_Pwm_Output(currentBrightness);
    if (sliderBrightness && esp_lv_adapter_lock(100)) {
      lv_slider_set_value(sliderBrightness, currentBrightness, LV_ANIM_OFF);
      if (lblBrightnessVal) {
        char bBuf[16];
        snprintf(bBuf, sizeof(bBuf), "%d%%", currentBrightness);
        lv_label_set_text(lblBrightnessVal, bBuf);
      }
      esp_lv_adapter_unlock();
    }
  }

  // Start decoy servers
  srvTelnet.begin();
  srvSSH.begin();
  srvFTP.begin();
  srvHTTP.begin();
  srvAdmin.begin();
  srvTelnet.setNoDelay(true);
  srvHTTP.setNoDelay(true);

