pegasus0069/VERA/ESP32-VERA/vera_esp32_code/vera_esp32_code.ino
  // Start lwIP raw ICMP echo interception
  startIcmpWatch();

  // Initial UI refresh
  updateDashboardMetrics();
  updateIpTableUI();
  updateLootUI();
  updateStatusBarUI();

  // Allow LVGL 80ms to render the initial styled frame into DMA buffers before turning on backlight
  delay(80);

  // Turn ON LCD backlight cleanly now that UI is fully loaded and themed
  Serial.printf("[INIT] Enabling LCD backlight cleanly (%d%% PWM)...\n", currentBrightness);
  IO_EXTENSION_Pwm_Output(currentBrightness);
  wavesahre_rgb_lcd_bl_on();

  logEvent("SYS", WiFi.localIP(),
           String(sdOk ? "System Armed" : "System Armed (NO SD)") + " Boot #" + String(st.boots),
           0x8B949E, false);
  saveState(true);
  Serial.println("[READY] VERA Armed & Monitoring.");
  printf("[READY] VERA Armed & Monitoring.\n");
  fflush(stdout);
}

void loop() {
  serviceIcmp();
  handleTelnet();
  handleSSH();
  handleFTP();
  handleHTTP();
  handleAdmin();

  static uint32_t lastClockSec = 0;
  static uint32_t lastWiFiAttempt = 0;
  if ((millis() - lastClockSec) > 1000) {
    lastClockSec = millis();
    updateStatusBarUI();
    saveState(false);

    if (WiFi.status() != WL_CONNECTED) {
      if (!wifiIsConnecting && !wifiIsScanning && (millis() - lastWiFiAttempt) > 15000) {
        lastWiFiAttempt = millis();
        Serial.printf("[WIFI] Disconnected - retrying %s...\n", curWifiSsid);
        esp_wifi_set_storage(WIFI_STORAGE_RAM);
        esp_wifi_disconnect();
        WiFi.begin(curWifiSsid, curWifiPass);
      }
    } else {
      lastWiFiAttempt = millis();
      if (!ntpConfigured) {
        configTime(GMT_OFFSET_SEC, DST_OFFSET_SEC, "pool.ntp.org", "time.nist.gov");
        ntpConfigured = true;
        Serial.printf("[NTP] Connected to network. Synchronizing time with %s\n", WiFi.localIP().toString().c_str());
      }
    }
  }
  delay(2);
}
